
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьРабочийСтол(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		
		ОткрытьФорму("Документ.mega_ЗаказПокупателя_FBS_OZON.Форма.РабочийСтол", 
			Новый Структура("Ключ", ТекущиеДанные.Ссылка));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект,
		Новый Структура("ТекШтрихкод", ТекШтрихкод));	
	ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(Результат);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(Штрихкод)
	
	Если Штрихкод <> 0 Тогда
		
		ЗаказПокупателяFBSOZON = ПолучитьЗаказПокупателяFBSOZONПоID(Штрихкод);		
		Если ЗначениеЗаполнено(ЗаказПокупателяFBSOZON) Тогда 
			
			ОткрытьФорму("Документ.mega_ЗаказПокупателя_FBS_OZON.Форма.РабочийСтол", 
				Новый Структура("Ключ", ЗаказПокупателяFBSOZON));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаказПокупателяFBSOZONПоID(ID)
	
	ЗаказПокупателяСсылка = 
	Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(Лев(ID, 8) + "-" + 
																				Сред(ID, 9, 4) + "-" + 
																				Сред(ID, 13, 4) + "-" + 
																				Сред(ID, 17, 4) + "-" + 
																				Прав(ID, 12)));
	ЗаказПокупателя = ЗаказПокупателяСсылка.ПолучитьОбъект();
	Если ЗаказПокупателя = Неопределено Тогда
		
		Возврат Документы.mega_ЗаказПокупателя_FBS_OZON.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Документы.mega_ЗаказПокупателя_FBS_OZON.ЗаказПокупателяFBSOZONПоЗаказуПокупателя(ЗаказПокупателя.Ссылка);
КонецФункции

#КонецОбласти
