
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект,
		Новый Структура("ТекШтрихкод", ТекШтрихкод));	
	ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
		
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(Результат);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	Если ДанныеШтрихкодов.Количество() > 0 Тогда
		
		Если ТипЗнч(ДанныеШтрихкодов) = Тип("Структура") Тогда
		    ПерваяЗапись = ДанныеШтрихкодов;
		Иначе
			
			ПерваяЗапись = ДанныеШтрихкодов[0];		
		КонецЕсли;
		
		
		ЗаказПокупателяFBSOZON = ПолучитьЗаказПокупателяFBSOZONПоID(ПерваяЗапись.Штрихкод);
		
		Если ЗначениеЗаполнено(ЗаказПокупателяFBSOZON) Тогда 
			
			ОткрытьФорму("Документ.mega_ЗаказПокупателя_FBS_OZON.Форма.РабочийСтол", 
				Новый Структура("Ключ", ЗаказПокупателяFBSOZON));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаказПокупателяFBSOZONПоID(ID)
	
	ЗаказПокупателяСсылка = 
	Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(Лев(ID, 8) + "-" + 
																				Сред(ID, 9, 4) + "-" + 
																				Сред(ID, 13, 4) + "-" + 
																				Сред(ID, 17, 4) + "-" + 
																				Прав(ID, 12)));
	ЗаказПокупателя = ЗаказПокупателяСсылка.ПолучитьОбъект();
	Если ЗаказПокупателя = Неопределено Тогда
		
		Возврат Документы.mega_ЗаказПокупателя_FBS_OZON.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Документы.mega_ЗаказПокупателя_FBS_OZON.ЗаказПокупателяFBSOZONПоЗаказуПокупателя(ЗаказПокупателя);
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
