#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает признак активности для записей регистров.
//
Процедура УстановитьАктивностьДвижений(ФлагАктивности)
	
	СтруктураПоиска = Новый Структура("Имя","Запасы");
	НайденныеСтроки = ТаблицаРегистров.НайтиСтроки(СтруктураПоиска);
	РегистрЗапасыВыбран = НайденныеСтроки.Количество();
	
	ОбновитьРегистрОстатки = Ложь;
	Если РегистрЗапасыВыбран Тогда
		ТаблицаНоменклатурыДляОбновленияОстатков = ТаблицаНоменклатурыЗапасыПоРегистратору();
		ОбновитьРегистрОстатки = ТаблицаНоменклатурыДляОбновленияОстатков.Количество();
	КонецЕсли;
	
	Для Каждого Движение Из Движения Цикл
		
		Движение.Прочитать();
		Движение.УстановитьАктивность(ФлагАктивности);
		
		Если ТипЗнч(Движение) = Тип("РегистрНакопленияНаборЗаписей.Запасы") И ОбновитьРегистрОстатки Тогда
			Движение.ДополнительныеСвойства.Вставить("ТаблицаНоменклатурыДляОбновленияОстатков", ТаблицаНоменклатурыДляОбновленияОстатков);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // УстановитьАктивностьДвижений()

Функция ТаблицаНоменклатурыЗапасыПоРегистратору()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Запасы.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Регистратор = &Регистратор
	|	И НЕ Запасы.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() И Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда
		УстановитьАктивностьДвижений(НЕ ПометкаУдаления);
	ИначеЕсли ПометкаУдаления Тогда
		УстановитьАктивностьДвижений(Ложь);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли