Функция ПолучитьВысотуПоддонаПоЕгоВиду(ВидПоддона)Экспорт 
	
	ВидыПоддонов = Новый Соответствие;
	ВидыПоддонов.Вставить(Высота1600Низкий, 1600);
	ВидыПоддонов.Вставить(Высота1800Стандарт, 1800);
	ВидыПоддонов.Вставить(Высота2100СверхНормы, 2100);
	
	Возврат ВидыПоддонов.Получить(ВидПоддона);
КонецФункции

Функция РассчитатьКоличествоНаПоддоне(ВидПоддона, Размер1 = 10, Размер2 = 10, Размер3 = 10)Экспорт 
	
	ШиринаПоддона = 1200;
	ДлинаПоддона = 800;	
	ВысотаПоддона = ПолучитьВысотуПоддонаПоЕгоВиду(ВидПоддона);
	
	КоличествоПоШирине1 = Цел(ШиринаПоддона / Размер1);
	КоличествоПоШирине2 = Цел(ШиринаПоддона / Размер2);
	КоличествоПоШирине3 = Цел(ШиринаПоддона / Размер3);
	
	КоличествоПоДлине1 = Цел(ДлинаПоддона / Размер1);
	КоличествоПоДлине2 = Цел(ДлинаПоддона / Размер2);
	КоличествоПоДлине3 = Цел(ДлинаПоддона / Размер3);
	
	КоличествоПоВысоте1 = Цел(ВысотаПоддона / Размер1);
	КоличествоПоВысоте2 = Цел(ВысотаПоддона / Размер2);
	КоличествоПоВысоте3 = Цел(ВысотаПоддона / Размер3);	
	
	МасимальноеКоличество1 = КоличествоПоШирине1 * КоличествоПоДлине2 * КоличествоПоВысоте3;
	МасимальноеКоличество2 = КоличествоПоШирине1 * КоличествоПоДлине3 * КоличествоПоВысоте2;
	МасимальноеКоличество3 = КоличествоПоШирине2 * КоличествоПоДлине1 * КоличествоПоВысоте3;
	МасимальноеКоличество4 = КоличествоПоШирине2 * КоличествоПоДлине3 * КоличествоПоВысоте1;
	МасимальноеКоличество5 = КоличествоПоШирине3 * КоличествоПоДлине2 * КоличествоПоВысоте1;
	МасимальноеКоличество6 = КоличествоПоШирине3 * КоличествоПоДлине1 * КоличествоПоВысоте2;
	
	Возврат Макс(МасимальноеКоличество1, 
				 МасимальноеКоличество2, 
				 МасимальноеКоличество3, 
				 МасимальноеКоличество4, 
				 МасимальноеКоличество5, 
				 МасимальноеКоличество6);
КонецФункции