#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТипПолучателя = Элементы.ТипПолучателя.СписокВыбора[0].Значение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьКнопка(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСписок(Команда)
	
	Адресаты = СтрЗаменить(СтрокаДляОбработки, ",", ";");
	Адресаты = СтрЗаменить(Адресаты, Символы.ПС, ";");
	Адресаты = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Адресаты);
	
	АдресВХранилище = АдресПолучателейИзСтроки(Адресаты);
	Закрыть(АдресВХранилище);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция АдресПолучателейИзСтроки(Адресаты)
	
	АдресВХранилище = ЭлектроннаяПочтаУНФ.АдресАдресатовВоВременномХранилище(Адресаты, ТипПолучателя);
	Возврат АдресВХранилище;
	
КонецФункции

#КонецОбласти


