
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторГруппы = Параметры.ИдентификаторГруппы;
	ПоказатьВсе = Параметры.ПоказатьВсе;
	ОбязательноЗаполнять = Параметры.ОбязательноЗаполнять;
	СсылкаНаУзелОбмена = Параметры.СсылкаНаУзелОбмена;
	ОткрытьУзелОбменаПослеЗакрытия = Параметры.ОткрытьУзелОбменаПослеЗакрытия;
	ПоказатьНоменклатуру = Параметры.ПоказатьНоменклатуру;
	
	Элементы.ФормаПоказатьВсе.Пометка = ПоказатьВсе;
	Элементы.ФормаПоказатьНоменклатуру.Пометка = ПоказатьНоменклатуру;
	Элементы.ФормаЗагрузитьНоменклатуру.Видимость = ПоказатьНоменклатуру;
	
	ОбновитьДеревоНаСервере();
	
	Если ПоказатьНоменклатуру Тогда
		Заголовок = НСтр("ru = 'Настройка загрузки товаров ВКонтакте'");
	Иначе
		Заголовок = НСтр("ru = 'Настройка категорий товаров для обмена с ВКонтакте'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ОбязательноЗаполнять Тогда
		
		МассивНаименований = Новый Массив;
		
		Для Каждого СтрРодитель Из ДеревоКатегорийТоваров.ПолучитьЭлементы() Цикл
			Для Каждого СтрЭлемент Из СтрРодитель.ПолучитьЭлементы() Цикл
				
				Если СтрЭлемент.Используется И НЕ (ЗначениеЗаполнено(СтрЭлемент.КатегорияНоменклатуры) Или ЗначениеЗаполнено(СтрЭлемент.ГруппаНоменклатуры)) Тогда
					МассивНаименований.Добавить(СтрШаблон("%1/%2",СтрРодитель.Наименование,СтрЭлемент.Наименование));
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Если МассивНаименований.Количество() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните используемые категории:" + Символы.ПС + СтрСоединить(МассивНаименований,", "),,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Не Отказ И ОткрытьУзелОбменаПослеЗакрытия Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ" , СсылкаНаУзелОбмена);
		
		ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаУзлаВКонтакте", ПараметрыФормы, ЭтаФорма.ВладелецФормы,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовЭлементовФормы

&НаКлиенте
Процедура ДеревоКатегорийТоваровПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКатегорийТоваровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьФорму(Команда)
	ЗаписатьФормуНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьФормуНаКлиенте();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(Команда)
	ОбновитьДеревоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсе(Команда)
	
	ПоказатьВсе = НЕ ПоказатьВсе;
	
	Элементы.ФормаПоказатьВсе.Пометка = ПоказатьВсе;
	ОбновитьДеревоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНоменклатуру(Команда)
	ПоказатьНоменклатуру = НЕ ПоказатьНоменклатуру;
	
	Элементы.ФормаПоказатьНоменклатуру.Пометка = ПоказатьНоменклатуру;
	ОбновитьДеревоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКатегорийТоваровПриАктивизацииСтроки(Элемент)
	
	Если ПоказатьНоменклатуру Тогда
		
		ТекущиеДанные = Элементы.ДеревоКатегорийТоваров.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторКатегории" , "-");
			Элементы.ТаблицаНоменклатур.ОтборСтрок = ОтборСтрок;
			Возврат;
		КонецЕсли;
		
		ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторКатегории" , ТекущиеДанные.Идентификатор);
		Элементы.ТаблицаНоменклатур.ОтборСтрок = ОтборСтрок;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатурПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатурПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаХарактеристикПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаХарактеристикПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатурПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаНоменклатур.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторНоменклатуры" , "-");
		Элементы.ТаблицаХарактеристик.ОтборСтрок = ОтборСтрок;
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторНоменклатуры" , ТекущиеДанные.Идентификатор);
	Элементы.ТаблицаХарактеристик.ОтборСтрок = ОтборСтрок;
	
	Элементы.СтраницыХарактеристик.ТекущаяСтраница 
	= ?(ТекущиеДанные.ЕстьХарактеристики, Элементы.СтраницаТаблицаХарактеристик, Элементы.СтраницаНетХарактеристик);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДополнительныхРеквизитовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДополнительныхРеквизитовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийДополнительныхРеквизитовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийДополнительныхРеквизитовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДополнительныхРеквизитовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаДополнительныхРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторДополнительногоРеквизита" , "-");
		Элементы.ТаблицаЗначенийДополнительныхРеквизитов.ОтборСтрок = ОтборСтрок;
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторДополнительногоРеквизита" , ТекущиеДанные.Идентификатор);
	Элементы.ТаблицаЗначенийДополнительныхРеквизитов.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНоменклатуру(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьНоменклатуруЗавершение", ЭтаФорма);
	
	ОписаниеУзлаОбменаВК = Новый Структура;
	ОписаниеУзлаОбменаВК.Вставить("СсылкаНаУзелОбмена" , СсылкаНаУзелОбмена);
	
	ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаЗагрузки", ОписаниеУзлаОбменаВК, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеПриИзменении(Элемент)
	ОбновитьДеревоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НайтиНоменклатуру(Команда)
	НайтиНоменклатуруНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВиртуальныеКаталогиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВиртуальныеКаталогиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДеревоНаСервере()
	
	СоответствиеКаталогов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СопоставлениеКаталоговДляМагазинаСоцСетей.Идентификатор КАК Идентификатор,
	|	СопоставлениеКаталоговДляМагазинаСоцСетей.Наименование КАК Наименование,
	|	СопоставлениеКаталоговДляМагазинаСоцСетей.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
	|	СопоставлениеКаталоговДляМагазинаСоцСетей.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	|ИЗ
	|	РегистрСведений.СопоставлениеКаталоговДляМагазинаСоцСетей КАК СопоставлениеКаталоговДляМагазинаСоцСетей
	|ГДЕ
	|	СопоставлениеКаталоговДляМагазинаСоцСетей.УзелИнформационнойБазы = &СсылкаНаУзелОбмена";
	
	Запрос.УстановитьПараметр("СсылкаНаУзелОбмена", СсылкаНаУзелОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураКаталога = Новый Структура;
		СтруктураКаталога.Вставить("КатегорияНоменклатуры" , ВыборкаДетальныеЗаписи.КатегорияНоменклатуры);
		СтруктураКаталога.Вставить("ГруппаНоменклатуры" , ВыборкаДетальныеЗаписи.ГруппаНоменклатуры);
		
		СоответствиеКаталогов.Вставить(ВыборкаДетальныеЗаписи.Идентификатор, СтруктураКаталога);
		
	КонецЦикла;
	
	СоответствиеУдалениеСтрок = Новый Соответствие;
	
	ОписаниеУзлаОбмена = ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.ПолучитьОписаниеУзлаОбмена(СсылкаНаУзелОбмена);
	
	ДеревоКатегорийТоваров.ПолучитьЭлементы().Очистить();
	
	МассивИспользуемыхВМагазине = ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.ПолучитьИспользуемыеКатегорииТоваров(ОписаниеУзлаОбмена);
	КатегорииТоваров = ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.ПолучитьКатегорийТоваров(ОписаниеУзлаОбмена);
	Для Каждого СтрРодитель Из КатегорииТоваров Цикл
		
		НовРодитель = ДеревоКатегорийТоваров.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НовРодитель, СтрРодитель, "Наименование,Идентификатор");
		ЗаполнитьКаталогСтроки(НовРодитель, СоответствиеКаталогов);
		НовРодитель.ЭтоГруппа = Истина;
		
		ЕстьИспользование = Ложь;
		
		Для Каждого СтрЭлемент Из СтрРодитель.Строки Цикл
			
			НовСтрока = НовРодитель.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрЭлемент, "Наименование,Идентификатор");
			ЗаполнитьКаталогСтроки(НовСтрока, СоответствиеКаталогов);
			НовСтрока.Используется = (МассивИспользуемыхВМагазине.Найти(НовСтрока.Идентификатор) <> Неопределено); 
			
			ЕстьИспользование = Макс(ЕстьИспользование, НовСтрока.Используется);
			
			Если Не НовСтрока.Используется Тогда
				СоответствиеУдалениеСтрок.Вставить(НовСтрока,НовРодитель);
			КонецЕсли;
			
		КонецЦикла;
		
		НовРодитель.Используется = ЕстьИспользование;
		
		Если Не НовРодитель.Используется Тогда
			СоответствиеУдалениеСтрок.Вставить(НовРодитель);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивИспользуемыхВМагазине.Количество() И НЕ ПоказатьВсе И СоответствиеУдалениеСтрок.Количество() Тогда
		
		Для Каждого КлючЗначение Из СоответствиеУдалениеСтрок Цикл
			Если КлючЗначение.Значение <> Неопределено Тогда
				КлючЗначение.Значение.ПолучитьЭлементы().Удалить(КлючЗначение.Ключ)
			КонецЕсли;
		КонецЦикла;
		Для Каждого КлючЗначение Из СоответствиеУдалениеСтрок Цикл
			Если КлючЗначение.Значение = Неопределено Тогда
				ДеревоКатегорийТоваров.ПолучитьЭлементы().Удалить(КлючЗначение.Ключ)
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаНоменклатур.Очистить();
	ТаблицаХарактеристик.Очистить();
	ТаблицаДополнительныхРеквизитов.Очистить();
	ТаблицаЗначенийДополнительныхРеквизитов.Очистить();
	Элементы.ГруппаНоменклатура.Видимость = ПоказатьНоменклатуру;
	//Элементы.СтраницаДополнительныеРеквизиты.Видимость = ПоказатьНоменклатуру;
	Если ПоказатьНоменклатуру Тогда
		
		ОписаниеУзелОбмена = ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.ПолучитьОписаниеУзлаОбмена(СсылкаНаУзелОбмена);
		
		МассивТоваров = ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.ПолучитьВсеТоварыИзМагазина(ОписаниеУзлаОбмена,Истина);
		Для Каждого ОписаниеНоменклатура Из МассивТоваров Цикл
			
			Если ЗначениеЗаполнено(ОписаниеНоменклатура.ИдентификаторНоменклатуры) Тогда
				НовСтр = ТаблицаХарактеристик.Добавить();
				НовСтр.Идентификатор = ОписаниеНоменклатура.Идентификатор;
				НовСтр.Наименование = ОписаниеНоменклатура.Наименование;
				НовСтр.Артикул = ОписаниеНоменклатура.Артикул; 
				НовСтр.ИдентификаторНоменклатуры = ОписаниеНоменклатура.ИдентификаторНоменклатуры;
			Иначе
				НовСтр = ТаблицаНоменклатур.Добавить();
				НовСтр.Идентификатор = ОписаниеНоменклатура.Идентификатор;
				НовСтр.Наименование = ОписаниеНоменклатура.Наименование;
				НовСтр.Артикул = ОписаниеНоменклатура.Артикул; 
				НовСтр.ИдентификаторКатегории = ОписаниеНоменклатура.ИдентификаторКатегории;
				НовСтр.ЕстьХарактеристики = ОписаниеНоменклатура.ЕстьХарактеристики;
			КонецЕсли;
			
		КонецЦикла;
		
		//ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.ЗаполнитьТаблицыНаборов(СсылкаНаУзелОбмена, МассивТоваров
		//, ТаблицаДополнительныхРеквизитов, ТаблицаЗначенийДополнительныхРеквизитов);
		
		ПодборкиТоваров = ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.ПолучитьПодборкиТоваров(ОписаниеУзелОбмена);
		
		Если ПодборкиТоваров.Количество() Тогда
			Элементы.СтраницаВиртуальныеКаталоги.Видимость = Истина;
			Элементы.СтраницыТело.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		Иначе
			Элементы.СтраницаВиртуальныеКаталоги.Видимость = Ложь;
			Элементы.СтраницыТело.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		КонецЕсли;
		
		Если ПодборкиТоваров.Количество() = 0 Тогда
			МассивИдентификаторов = Новый Массив;
		Иначе
			МассивИдентификаторов = Новый Массив(ПодборкиТоваров.Количество());
			Для Н = 0 По ПодборкиТоваров.ВГраница() Цикл
				МассивИдентификаторов[Н] = ПодборкиТоваров[Н].Идентификатор;
			КонецЦикла;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаНоменклатур.Идентификатор КАК Идентификатор,
		|	ТаблицаНоменклатур.ИдентификаторКатегории КАК ИдентификаторКатегории,
		|	ТаблицаНоменклатур.ЕстьХарактеристики КАК ЕстьХарактеристики,
		|	ТаблицаНоменклатур.Наименование КАК Наименование,
		|	ТаблицаНоменклатур.Артикул КАК Артикул
		|ПОМЕСТИТЬ ВТ_ТаблицаНоменклатур
		|ИЗ
		|	&ТаблицаНоменклатур КАК ТаблицаНоменклатур
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаХарактеристик.Идентификатор КАК Идентификатор,
		|	ТаблицаХарактеристик.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
		|	ТаблицаХарактеристик.Наименование КАК Наименование,
		|	ТаблицаХарактеристик.Артикул КАК Артикул
		|ПОМЕСТИТЬ ВТ_ТаблицаХарактеристик
		|ИЗ
		|	&ТаблицаХарактеристик КАК ТаблицаХарактеристик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СопоставлениеИдентификаторовМагазиновСоцСетей.Ссылка КАК Ссылка,
		|	СопоставлениеИдентификаторовМагазиновСоцСетей.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.СопоставлениеИдентификаторовМагазиновСоцСетей КАК СопоставлениеИдентификаторовМагазиновСоцСетей
		|ГДЕ
		|	СопоставлениеИдентификаторовМагазиновСоцСетей.УзелИнформационнойБазы = &УзелИнформационнойБазы
		|	И СопоставлениеИдентификаторовМагазиновСоцСетей.Идентификатор В(&МассивИдентификаторов)
		|	И СопоставлениеИдентификаторовМагазиновСоцСетей.ТипИдентификатора = ""album""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаНоменклатур.Идентификатор КАК Идентификатор,
		|	СопоставлениеИдентификаторовМагазиновСоцСетей.Ссылка КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	ВТ_ТаблицаНоменклатур.Наименование КАК Наименование,
		|	ВТ_ТаблицаНоменклатур.Артикул КАК Артикул,
		|	ВТ_ТаблицаНоменклатур.ИдентификаторКатегории КАК ИдентификаторКатегории,
		|	ВТ_ТаблицаНоменклатур.ЕстьХарактеристики КАК ЕстьХарактеристики
		|ИЗ
		|	ВТ_ТаблицаНоменклатур КАК ВТ_ТаблицаНоменклатур
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеИдентификаторовМагазиновСоцСетей КАК СопоставлениеИдентификаторовМагазиновСоцСетей
		|		ПО ВТ_ТаблицаНоменклатур.Идентификатор = СопоставлениеИдентификаторовМагазиновСоцСетей.Идентификатор
		|			И (СопоставлениеИдентификаторовМагазиновСоцСетей.УзелИнформационнойБазы = &УзелИнформационнойБазы)
		|			И (СопоставлениеИдентификаторовМагазиновСоцСетей.ТипИдентификатора = ""item"")
		|			И (ВЫРАЗИТЬ(СопоставлениеИдентификаторовМагазиновСоцСетей.Ссылка КАК Справочник.Номенклатура) Ссылка Справочник.Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаХарактеристик.Идентификатор КАК Идентификатор,
		|	СопоставлениеИдентификаторовМагазиновСоцСетей.Ссылка КАК Характеристика,
		|	СопоставлениеИдентификаторовМагазиновСоцСетей.Ссылка.Владелец КАК Номенклатура,
		|	ВТ_ТаблицаХарактеристик.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
		|	ВТ_ТаблицаХарактеристик.Наименование КАК Наименование,
		|	ВТ_ТаблицаХарактеристик.Артикул КАК Артикул
		|ИЗ
		|	ВТ_ТаблицаХарактеристик КАК ВТ_ТаблицаХарактеристик
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеИдентификаторовМагазиновСоцСетей КАК СопоставлениеИдентификаторовМагазиновСоцСетей
		|		ПО ВТ_ТаблицаХарактеристик.Идентификатор = СопоставлениеИдентификаторовМагазиновСоцСетей.Идентификатор
		|			И (СопоставлениеИдентификаторовМагазиновСоцСетей.УзелИнформационнойБазы = &УзелИнформационнойБазы)
		|			И (СопоставлениеИдентификаторовМагазиновСоцСетей.ТипИдентификатора = ""item"")
		|			И (ВЫРАЗИТЬ(СопоставлениеИдентификаторовМагазиновСоцСетей.Ссылка КАК Справочник.ХарактеристикиНоменклатуры) Ссылка Справочник.ХарактеристикиНоменклатуры)";
		
		Запрос.УстановитьПараметр("ТаблицаНоменклатур" , ТаблицаНоменклатур.Выгрузить());
		Запрос.УстановитьПараметр("ТаблицаХарактеристик" , ТаблицаХарактеристик.Выгрузить());
		Запрос.УстановитьПараметр("УзелИнформационнойБазы" , СсылкаНаУзелОбмена);
		Запрос.УстановитьПараметр("МассивИдентификаторов" , МассивИдентификаторов);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ТаблицаНоменклатур.Очистить();
		ТаблицаНоменклатур.Загрузить(РезультатЗапроса[РезультатЗапроса.ВГраница() - 1].Выгрузить());
		ТаблицаХарактеристик.Очистить();
		ТаблицаХарактеристик.Загрузить(РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить());
		
		СоответствиеПодборок = Новый Соответствие;
		ВыборкаДетальныеЗаписи = РезультатЗапроса[РезультатЗапроса.ВГраница() - 2].Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СоответствиеПодборок.Вставить(ВыборкаДетальныеЗаписи.Идентификатор, ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
		
		ТаблицаВиртуальныеКаталоги.Очистить();
		Для Н = 0 По ПодборкиТоваров.ВГраница() Цикл
			ТекОписание = ПодборкиТоваров[Н];
			
			НовСтр = ТаблицаВиртуальныеКаталоги.Добавить();
			НовСтр.Наименование = ТекОписание.Наименование;
			НовСтр.Идентификатор = ТекОписание.Идентификатор;
			НовСтр.ВиртуальныйКаталог = СоответствиеПодборок.Получить(ТекОписание.Идентификатор);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКаталогСтроки(Строка, СоответствиеКаталогов)
	
	ОписаниеКаталога = СоответствиеКаталогов.Получить(Строка.Идентификатор);
	Если ОписаниеКаталога = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Строка, ОписаниеКаталога, "КатегорияНоменклатуры,ГруппаНоменклатуры");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьФормуНаСервере()
	
	НЗ = РегистрыСведений.СопоставлениеКаталоговДляМагазинаСоцСетей.СоздатьНаборЗаписей();
	НЗ.Отбор.УзелИнформационнойБазы.Установить(СсылкаНаУзелОбмена);
	
	ЗаписатьФормуНаСервереРекурсивно(ДеревоКатегорийТоваров, НЗ);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Попытка
		НЗ.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
	ЗаписатьТоварыНаСервере();
	ЗаписатьВиртуальныеКаталогиНаСервере();
	
	ОбновитьДеревоНаСервере();
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("СсылкаНаУзелОбмена", СсылкаНаУзелОбмена);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "ПроверитьОбновитьФайлыНоменклатур";
	ПараметрыВыполнения.ЗапуститьНеВФоне = Ложь;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Попытка
		ДлительныеОперации.ВыполнитьВФоне(
		"ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.ПроверитьОбновитьФайлыНоменклатур",
		ПараметрыЗадания,
		ПараметрыВыполнения);
	Исключение
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ПредставлениеОшибки;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьФормуНаСервереРекурсивно(СтрокаДерева, СопоставлениеКаталоговВнешнейСистемы)
	
	Для Каждого Стр Из СтрокаДерева.ПолучитьЭлементы() Цикл
		
		Если ЗначениеЗаполнено(Стр.КатегорияНоменклатуры) Или ЗначениеЗаполнено(Стр.ГруппаНоменклатуры) Тогда
			НовСтр = СопоставлениеКаталоговВнешнейСистемы.Добавить();
			НовСтр.УзелИнформационнойБазы = СсылкаНаУзелОбмена;
			НовСтр.Идентификатор = Стр.Идентификатор;
			НовСтр.Наименование = Стр.Наименование;
			НовСтр.КатегорияНоменклатуры = Стр.КатегорияНоменклатуры;
			НовСтр.ГруппаНоменклатуры = Стр.ГруппаНоменклатуры;
		КонецЕсли;
		
		Если Стр.ПолучитьЭлементы().Количество() Тогда
			ЗаписатьФормуНаСервереРекурсивно(Стр, СопоставлениеКаталоговВнешнейСистемы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьФормуНаКлиенте()
	ЗаписатьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНоменклатуруЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НайтиНоменклатуруНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНоменклатур.Идентификатор КАК Идентификатор,
	|	ТаблицаНоменклатур.ИдентификаторКатегории КАК ИдентификаторКатегории,
	|	ТаблицаНоменклатур.ЕстьХарактеристики КАК ЕстьХарактеристики,
	|	ТаблицаНоменклатур.Наименование КАК Наименование,
	|	ТаблицаНоменклатур.Артикул КАК Артикул
	|ПОМЕСТИТЬ ВТ_ТаблицаНоменклатур
	|ИЗ
	|	&ТаблицаНоменклатур КАК ТаблицаНоменклатур
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаХарактеристик.Идентификатор КАК Идентификатор,
	|	ТаблицаХарактеристик.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	ТаблицаХарактеристик.Наименование КАК Наименование,
	|	ТаблицаХарактеристик.Артикул КАК Артикул
	|ПОМЕСТИТЬ ВТ_ТаблицаХарактеристик
	|ИЗ
	|	&ТаблицаХарактеристик КАК ТаблицаХарактеристик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаНоменклатур.Идентификатор КАК Идентификатор,
	|	СопоставлениеИдентификаторовМагазиновСоцСетей.Ссылка КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_ТаблицаНоменклатур КАК ВТ_ТаблицаНоменклатур
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеИдентификаторовМагазиновСоцСетей КАК СопоставлениеИдентификаторовМагазиновСоцСетей
	|		ПО ВТ_ТаблицаНоменклатур.Идентификатор = СопоставлениеИдентификаторовМагазиновСоцСетей.Идентификатор
	|ГДЕ
	|	СопоставлениеИдентификаторовМагазиновСоцСетей.УзелИнформационнойБазы = &УзелИнформационнойБазы
	|	И СопоставлениеИдентификаторовМагазиновСоцСетей.ТипИдентификатора = ""item""
	|	И ВЫРАЗИТЬ(СопоставлениеИдентификаторовМагазиновСоцСетей.Ссылка КАК Справочник.Номенклатура) ССЫЛКА Справочник.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаНоменклатур.Идентификатор КАК Идентификатор,
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЛОЖЬ КАК Определен
	|ПОМЕСТИТЬ ВТ_ПоискПоНаименованиюАртикулу
	|ИЗ
	|	ВТ_ТаблицаНоменклатур КАК ВТ_ТаблицаНоменклатур
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ_ТаблицаНоменклатур.Артикул = Номенклатура.Артикул
	|			И (ВТ_ТаблицаНоменклатур.Наименование = (ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(1000)))
	|				ИЛИ ВТ_ТаблицаНоменклатур.Наименование = Номенклатура.Наименование)
	|ГДЕ
	|	НЕ ВТ_ТаблицаНоменклатур.Идентификатор В
	|				(ВЫБРАТЬ
	|					ВТ_Номенклатура.Идентификатор КАК Идентификатор
	|				ИЗ
	|					ВТ_Номенклатура КАК ВТ_Номенклатура)
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И ВТ_ТаблицаНоменклатур.Наименование <> """"
	|	И ВТ_ТаблицаНоменклатур.Артикул <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Идентификатор,
	|	ВТ_Номенклатура.Номенклатура,
	|	ВТ_Номенклатура.Характеристика,
	|	ИСТИНА
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаНоменклатур.Идентификатор КАК Идентификатор,
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЛОЖЬ КАК Определен
	|ПОМЕСТИТЬ ВТ_ПоискПоАртикулу
	|ИЗ
	|	ВТ_ТаблицаНоменклатур КАК ВТ_ТаблицаНоменклатур
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ_ТаблицаНоменклатур.Артикул = Номенклатура.Артикул
	|ГДЕ
	|	НЕ ВТ_ТаблицаНоменклатур.Идентификатор В
	|				(ВЫБРАТЬ
	|					ВТ_ПоискПоНаименованиюАртикулу.Идентификатор КАК Идентификатор
	|				ИЗ
	|					ВТ_ПоискПоНаименованиюАртикулу КАК ВТ_ПоискПоНаименованиюАртикулу)
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И ВТ_ТаблицаНоменклатур.Артикул <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПоискПоНаименованиюАртикулу.Идентификатор,
	|	ВТ_ПоискПоНаименованиюАртикулу.Номенклатура,
	|	ВТ_ПоискПоНаименованиюАртикулу.Характеристика,
	|	ВТ_ПоискПоНаименованиюАртикулу.Определен
	|ИЗ
	|	ВТ_ПоискПоНаименованиюАртикулу КАК ВТ_ПоискПоНаименованиюАртикулу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаНоменклатур.Идентификатор КАК Идентификатор,
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЛОЖЬ КАК Определен
	|ПОМЕСТИТЬ ВТ_ПоискПоНаименованию
	|ИЗ
	|	ВТ_ТаблицаНоменклатур КАК ВТ_ТаблицаНоменклатур
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (ВТ_ТаблицаНоменклатур.Наименование = (ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(1000)))
	|				ИЛИ ВТ_ТаблицаНоменклатур.Наименование = Номенклатура.Наименование)
	|ГДЕ
	|	НЕ ВТ_ТаблицаНоменклатур.Идентификатор В
	|				(ВЫБРАТЬ
	|					ВТ_ПоискПоАртикулу.Идентификатор КАК Идентификатор
	|				ИЗ
	|					ВТ_ПоискПоАртикулу КАК ВТ_ПоискПоАртикулу)
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И ВТ_ТаблицаНоменклатур.Наименование <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПоискПоАртикулу.Идентификатор,
	|	ВТ_ПоискПоАртикулу.Номенклатура,
	|	ВТ_ПоискПоАртикулу.Характеристика,
	|	ВТ_ПоискПоАртикулу.Определен
	|ИЗ
	|	ВТ_ПоискПоАртикулу КАК ВТ_ПоискПоАртикулу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаХарактеристик.Идентификатор КАК Идентификатор,
	|	СопоставлениеИдентификаторовМагазиновСоцСетей.Ссылка КАК Характеристика,
	|	СопоставлениеИдентификаторовМагазиновСоцСетей.Ссылка.Владелец КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Характеристика
	|ИЗ
	|	ВТ_ТаблицаХарактеристик КАК ВТ_ТаблицаХарактеристик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеИдентификаторовМагазиновСоцСетей КАК СопоставлениеИдентификаторовМагазиновСоцСетей
	|		ПО ВТ_ТаблицаХарактеристик.Идентификатор = СопоставлениеИдентификаторовМагазиновСоцСетей.Идентификатор
	|ГДЕ
	|	СопоставлениеИдентификаторовМагазиновСоцСетей.УзелИнформационнойБазы = &УзелИнформационнойБазы
	|	И СопоставлениеИдентификаторовМагазиновСоцСетей.ТипИдентификатора = ""item""
	|	И ВЫРАЗИТЬ(СопоставлениеИдентификаторовМагазиновСоцСетей.Ссылка КАК Справочник.ХарактеристикиНоменклатуры) ССЫЛКА Справочник.ХарактеристикиНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаХарактеристик.Идентификатор КАК Идентификатор,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
	|	ЛОЖЬ КАК Определен
	|ПОМЕСТИТЬ ВТ_ПоискПоНаименованиюАртикулуХарактеристика
	|ИЗ
	|	ВТ_ТаблицаХарактеристик КАК ВТ_ТаблицаХарактеристик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВТ_ТаблицаХарактеристик.Артикул = ХарактеристикиНоменклатуры.Артикул
	|			И (ВТ_ТаблицаХарактеристик.Наименование = (ВЫРАЗИТЬ(ХарактеристикиНоменклатуры.НаименованиеДляПечати КАК СТРОКА(1000)))
	|				ИЛИ ВТ_ТаблицаХарактеристик.Наименование = ХарактеристикиНоменклатуры.Наименование)
	|ГДЕ
	|	НЕ ВТ_ТаблицаХарактеристик.Идентификатор В
	|				(ВЫБРАТЬ
	|					ВТ_Характеристика.Идентификатор КАК Идентификатор
	|				ИЗ
	|					ВТ_Характеристика КАК ВТ_Характеристика)
	|	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|	И ВТ_ТаблицаХарактеристик.Артикул <> """"
	|	И ВТ_ТаблицаХарактеристик.Наименование <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаХарактеристик.Идентификатор КАК Идентификатор,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
	|	ЛОЖЬ КАК Определен
	|ПОМЕСТИТЬ ВТ_ПоискПоАртикулуХарактеристика
	|ИЗ
	|	ВТ_ТаблицаХарактеристик КАК ВТ_ТаблицаХарактеристик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВТ_ТаблицаХарактеристик.Артикул = ХарактеристикиНоменклатуры.Артикул
	|ГДЕ
	|	НЕ ВТ_ТаблицаХарактеристик.Идентификатор В
	|				(ВЫБРАТЬ
	|					ВТ_ПоискПоНаименованиюАртикулуХарактеристика.Идентификатор КАК Идентификатор
	|				ИЗ
	|					ВТ_ПоискПоНаименованиюАртикулуХарактеристика КАК ВТ_ПоискПоНаименованиюАртикулуХарактеристика)
	|	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|	И ВТ_ТаблицаХарактеристик.Артикул <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПоискПоНаименованиюАртикулуХарактеристика.Идентификатор,
	|	ВТ_ПоискПоНаименованиюАртикулуХарактеристика.Характеристика,
	|	ВТ_ПоискПоНаименованиюАртикулуХарактеристика.Номенклатура,
	|	ВТ_ПоискПоНаименованиюАртикулуХарактеристика.Определен
	|ИЗ
	|	ВТ_ПоискПоНаименованиюАртикулуХарактеристика КАК ВТ_ПоискПоНаименованиюАртикулуХарактеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаХарактеристик.Идентификатор КАК Идентификатор,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
	|	ЛОЖЬ КАК Определен
	|ПОМЕСТИТЬ ВТ_ПоискПоНаименованиюХарактеристика
	|ИЗ
	|	ВТ_ТаблицаХарактеристик КАК ВТ_ТаблицаХарактеристик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (ВТ_ТаблицаХарактеристик.Наименование = (ВЫРАЗИТЬ(ХарактеристикиНоменклатуры.НаименованиеДляПечати КАК СТРОКА(1000)))
	|				ИЛИ ВТ_ТаблицаХарактеристик.Наименование = ХарактеристикиНоменклатуры.Наименование)
	|ГДЕ
	|	НЕ ВТ_ТаблицаХарактеристик.Идентификатор В
	|				(ВЫБРАТЬ
	|					ВТ_ПоискПоАртикулуХарактеристика.Идентификатор КАК Идентификатор
	|				ИЗ
	|					ВТ_ПоискПоАртикулуХарактеристика КАК ВТ_ПоискПоАртикулуХарактеристика)
	|	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|	И ВТ_ТаблицаХарактеристик.Наименование <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПоискПоАртикулуХарактеристика.Идентификатор,
	|	ВТ_ПоискПоАртикулуХарактеристика.Характеристика,
	|	ВТ_ПоискПоАртикулуХарактеристика.Номенклатура,
	|	ВТ_ПоискПоАртикулуХарактеристика.Определен
	|ИЗ
	|	ВТ_ПоискПоАртикулуХарактеристика КАК ВТ_ПоискПоАртикулуХарактеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоискПоНаименованию.Идентификатор КАК Идентификатор,
	|	МАКСИМУМ(ВТ_ПоискПоНаименованию.Номенклатура) КАК Номенклатура,
	|	ВТ_ПоискПоНаименованию.Определен КАК Определен,
	|	ВТ_ТаблицаНоменклатур.Наименование КАК Наименование,
	|	ВТ_ТаблицаНоменклатур.Артикул КАК Артикул,
	|	ВТ_ТаблицаНоменклатур.ИдентификаторКатегории КАК ИдентификаторКатегории,
	|	ВТ_ТаблицаНоменклатур.ЕстьХарактеристики КАК ЕстьХарактеристики
	|ИЗ
	|	ВТ_ПоискПоНаименованию КАК ВТ_ПоискПоНаименованию
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаНоменклатур КАК ВТ_ТаблицаНоменклатур
	|		ПО ВТ_ПоискПоНаименованию.Идентификатор = ВТ_ТаблицаНоменклатур.Идентификатор
	|ГДЕ
	|	НЕ ВТ_ПоискПоНаименованию.Номенклатура В
	|				(ВЫБРАТЬ
	|					ВТ_ПоискПоНаименованию.Номенклатура КАК Номенклатура
	|				ИЗ
	|					ВТ_ПоискПоНаименованию КАК ВТ_ПоискПоНаименованию
	|				СГРУППИРОВАТЬ ПО
	|					ВТ_ПоискПоНаименованию.Номенклатура
	|				ИМЕЮЩИЕ
	|					КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПоискПоНаименованию.Идентификатор) > 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоискПоНаименованию.Идентификатор,
	|	ВТ_ПоискПоНаименованию.Определен,
	|	ВТ_ТаблицаНоменклатур.Наименование,
	|	ВТ_ТаблицаНоменклатур.ЕстьХарактеристики,
	|	ВТ_ТаблицаНоменклатур.ИдентификаторКатегории,
	|	ВТ_ТаблицаНоменклатур.Артикул
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаНоменклатур.Идентификатор,
	|	NULL,
	|	ЛОЖЬ,
	|	ВТ_ТаблицаНоменклатур.Наименование,
	|	ВТ_ТаблицаНоменклатур.Артикул,
	|	ВТ_ТаблицаНоменклатур.ИдентификаторКатегории,
	|	ВТ_ТаблицаНоменклатур.ЕстьХарактеристики
	|ИЗ
	|	ВТ_ТаблицаНоменклатур КАК ВТ_ТаблицаНоменклатур
	|ГДЕ
	|	НЕ ВТ_ТаблицаНоменклатур.Идентификатор В
	|				(ВЫБРАТЬ
	|					ВТ_ПоискПоНаименованию.Идентификатор КАК Идентификатор
	|				ИЗ
	|					ВТ_ПоискПоНаименованию КАК ВТ_ПоискПоНаименованию
	|				ГДЕ
	|					НЕ ВТ_ПоискПоНаименованию.Номенклатура В
	|							(ВЫБРАТЬ
	|								ВТ_ПоискПоНаименованию.Номенклатура КАК Номенклатура
	|							ИЗ
	|								ВТ_ПоискПоНаименованию КАК ВТ_ПоискПоНаименованию
	|							СГРУППИРОВАТЬ ПО
	|								ВТ_ПоискПоНаименованию.Номенклатура
	|							ИМЕЮЩИЕ
	|								КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПоискПоНаименованию.Идентификатор) > 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоискПоНаименованиюХарактеристика.Идентификатор КАК Идентификатор,
	|	МАКСИМУМ(ВТ_ПоискПоНаименованиюХарактеристика.Характеристика) КАК Характеристика,
	|	ВТ_ПоискПоНаименованиюХарактеристика.Определен КАК Определен,
	|	ВТ_ТаблицаХарактеристик.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	ВТ_ТаблицаХарактеристик.Наименование КАК Наименование,
	|	ВТ_ТаблицаХарактеристик.Артикул КАК Артикул
	|ИЗ
	|	ВТ_ПоискПоНаименованиюХарактеристика КАК ВТ_ПоискПоНаименованиюХарактеристика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаХарактеристик КАК ВТ_ТаблицаХарактеристик
	|		ПО ВТ_ПоискПоНаименованиюХарактеристика.Идентификатор = ВТ_ТаблицаХарактеристик.Идентификатор
	|ГДЕ
	|	НЕ (ВТ_ПоискПоНаименованиюХарактеристика.Номенклатура, ВТ_ПоискПоНаименованиюХарактеристика.Характеристика) В
	|				(ВЫБРАТЬ
	|					ВТ_ПоискПоНаименованиюХарактеристика.Номенклатура КАК Номенклатура,
	|					ВТ_ПоискПоНаименованиюХарактеристика.Характеристика КАК Характеристика
	|				ИЗ
	|					ВТ_ПоискПоНаименованиюХарактеристика КАК ВТ_ПоискПоНаименованиюХарактеристика
	|				СГРУППИРОВАТЬ ПО
	|					ВТ_ПоискПоНаименованиюХарактеристика.Номенклатура,
	|					ВТ_ПоискПоНаименованиюХарактеристика.Характеристика
	|				ИМЕЮЩИЕ
	|					КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПоискПоНаименованиюХарактеристика.Идентификатор) > 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоискПоНаименованиюХарактеристика.Идентификатор,
	|	ВТ_ТаблицаХарактеристик.ИдентификаторНоменклатуры,
	|	ВТ_ТаблицаХарактеристик.Наименование,
	|	ВТ_ПоискПоНаименованиюХарактеристика.Определен,
	|	ВТ_ТаблицаХарактеристик.Артикул
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаХарактеристик.Идентификатор,
	|	NULL,
	|	ЛОЖЬ,
	|	ВТ_ТаблицаХарактеристик.ИдентификаторНоменклатуры,
	|	ВТ_ТаблицаХарактеристик.Наименование,
	|	ВТ_ТаблицаХарактеристик.Артикул
	|ИЗ
	|	ВТ_ТаблицаХарактеристик КАК ВТ_ТаблицаХарактеристик
	|ГДЕ
	|	НЕ ВТ_ТаблицаХарактеристик.Идентификатор В
	|				(ВЫБРАТЬ
	|					ВТ_ПоискПоНаименованиюХарактеристика.Идентификатор КАК Идентификатор
	|				ИЗ
	|					ВТ_ПоискПоНаименованиюХарактеристика КАК ВТ_ПоискПоНаименованиюХарактеристика
	|				ГДЕ
	|					НЕ (ВТ_ПоискПоНаименованиюХарактеристика.Номенклатура, ВТ_ПоискПоНаименованиюХарактеристика.Характеристика) В
	|							(ВЫБРАТЬ
	|								ВТ_ПоискПоНаименованиюХарактеристика.Номенклатура КАК Номенклатура,
	|								ВТ_ПоискПоНаименованиюХарактеристика.Характеристика КАК Характеристика
	|							ИЗ
	|								ВТ_ПоискПоНаименованиюХарактеристика КАК ВТ_ПоискПоНаименованиюХарактеристика
	|							СГРУППИРОВАТЬ ПО
	|								ВТ_ПоискПоНаименованиюХарактеристика.Номенклатура,
	|								ВТ_ПоискПоНаименованиюХарактеристика.Характеристика
	|							ИМЕЮЩИЕ
	|								КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПоискПоНаименованиюХарактеристика.Идентификатор) > 1))";
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатур" , ТаблицаНоменклатур.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаХарактеристик" , ТаблицаХарактеристик.Выгрузить());
	Запрос.УстановитьПараметр("УзелИнформационнойБазы" , СсылкаНаУзелОбмена);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаНоменклатур.Очистить();
	ТаблицаНоменклатур.Загрузить(РезультатЗапроса[РезультатЗапроса.ВГраница() - 1].Выгрузить());
	ТаблицаХарактеристик.Очистить();
	ТаблицаХарактеристик.Загрузить(РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить());	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьТовары(Команда)
	ЗаписатьТоварыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТоварыНаСервере()
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	МассивИсключения = Новый Массив;
	Для Каждого Стр Из ТаблицаХарактеристик Цикл
		Если ЗначениеЗаполнено(Стр.Характеристика) Тогда
			МассивИсключения.Добавить(Стр.ИдентификаторНоменклатуры);
			
			НоваяЗапись = РегистрыСведений.СопоставлениеИдентификаторовМагазиновСоцСетей.СоздатьМенеджерЗаписи();
			НоваяЗапись.Идентификатор = Стр.Идентификатор;
			НоваяЗапись.Ссылка = Стр.Характеристика;
			НоваяЗапись.УзелИнформационнойБазы = СсылкаНаУзелОбмена;
			НоваяЗапись.ТипИдентификатора = "item";
			НоваяЗапись.ДатаЗагрузки = ТекущаяДатаСеанса();
			НоваяЗапись.Записать();
			
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из ТаблицаНоменклатур Цикл
		Если ЗначениеЗаполнено(Стр.Номенклатура) И МассивИсключения.Найти(Стр.Идентификатор) = Неопределено Тогда
			
			НоваяЗапись = РегистрыСведений.СопоставлениеИдентификаторовМагазиновСоцСетей.СоздатьМенеджерЗаписи();
			НоваяЗапись.Идентификатор = Стр.Идентификатор;
			НоваяЗапись.Ссылка = Стр.Номенклатура;
			НоваяЗапись.УзелИнформационнойБазы = СсылкаНаУзелОбмена;
			НоваяЗапись.ТипИдентификатора = "item";
			НоваяЗапись.ДатаЗагрузки = ТекущаяДатаСеанса();
			НоваяЗапись.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВиртуальныеКаталогиНаСервере()
	
	НЗ = РегистрыСведений.СопоставлениеИдентификаторовМагазиновСоцСетей.СоздатьНаборЗаписей();
	НЗ.Отбор.УзелИнформационнойБазы.Установить(СсылкаНаУзелОбмена);
	НЗ.Отбор.ТипИдентификатора.Установить("album");
	
	Для Каждого Стр Из ТаблицаВиртуальныеКаталоги Цикл
		Если ЗначениеЗаполнено(Стр.ВиртуальныйКаталог) Тогда
			
			НоваяЗапись = НЗ.Добавить();
			НоваяЗапись.Идентификатор = Стр.Идентификатор;
			НоваяЗапись.Ссылка = Стр.ВиртуальныйКаталог;
			НоваяЗапись.УзелИнформационнойБазы = СсылкаНаУзелОбмена;
			НоваяЗапись.ТипИдентификатора = "album";
			НоваяЗапись.ДатаЗагрузки = ТекущаяДатаСеанса();
			
		КонецЕсли;
	КонецЦикла;
	
	НЗ.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
