#Область ПрограммныйИнтерфейс

// Заполняет список значений Приемник из списка значений Источник
//
// Параметры:
// 	Источник - СписокЗначений - источник.
// 	Приемник - СписокЗначений - приемник.
Процедура ЗаполнитьСписокИзСписка(Источник, Приемник) Экспорт

	Приемник.Очистить();
	Для Каждого ЭлСписка Из Источник Цикл
		Приемник.Добавить(ЭлСписка.Значение, ЭлСписка.Представление);
	КонецЦикла;

КонецПроцедуры

// Функция получает элементы, присутствующие в каждом массиве
//
// Параметры:
//  Массив1	 - массив	 - первый массив
//  Массив2	 - массив	 - второй массив
// Возвращаемое значение:
//  массив - массив значений, содержащихся в двух массивах
Функция ПолучитьСовпадающиеЭлементыМассивов(Массив1, Массив2) Экспорт

	Результат = Новый Массив;

	Для Каждого Значение Из Массив1 Цикл
		Если Массив2.Найти(Значение) <> Неопределено Тогда
			Результат.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Проверяет соответствие реквизитов объекта параметрам отбора.
//
// Параметры:
//  Объект			 - Произвольный - объект, у которого нужно проверить наличие реквизита или свойства;
//  ПараметрыОтбора	 - Соответствие - Условия отбора.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ОбъектСоответствуетПараметрамОтбора(Объект, ПараметрыОтбора) Экспорт

	СоответствуетОтбору = Истина;

	Для Каждого ПараметрОтбора Из ПараметрыОтбора Цикл
		СоответствуетОтбору = (Объект[ПараметрОтбора.Ключ] = ПараметрОтбора.Значение);
		Если Не СоответствуетОтбору Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат СоответствуетОтбору;

КонецФункции

// Возвращает номер квартала, которому принадлежит переданная дата.
//
// Параметры:
//   Дата - Дата - дата, для которой необходимо вычислить номер квартала
//
// Возвращаемое значение:
//   Число - номер квартала
//
Функция НомерКвартала(Дата) Экспорт
	
	Возврат Месяц(КонецКвартала(Дата)) / 3;
	
КонецФункции

#Область РаботаСМассивами

// Удаление из массива пустых элементов
//
// Параметры:
//   МассивЭлементов - Массив
//
Процедура УдалитьНеЗаполненныеЭлементыМассива(МассивЭлементов) Экспорт

	КоличествоЭлементов = МассивЭлементов.Количество();
	Для Итератор = 1 По КоличествоЭлементов Цикл
		Если Не ЗначениеЗаполнено(МассивЭлементов[КоличествоЭлементов - Итератор]) Тогда
			МассивЭлементов.Удалить(КоличествоЭлементов - Итератор);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ТекстРазделителяЗапросовПакета() Экспорт

	ТекстРазделителя =
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";

	Возврат ТекстРазделителя;

КонецФункции

#КонецОбласти

// Возвращает картинку, используемую для сохранения настроек
// Возвращаемое значение:
//   Картинка
//
Функция КартинкаСохраненияНастроек() Экспорт
	
	Возврат БиблиотекаКартинок.СохранитьЗначениеНастройки;
	
КонецФункции

#КонецОбласти