#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	НапоминанияПользователяУНФ.УстановитьОтображениеКомандОрганайзера(Элементы);
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ВидОперации") Тогда
		ПустойМассив = Новый Массив;
		Параметры.Отбор.ВидОперации = Новый ФиксированныйМассив(ПустойМассив);
		Параметры.Отбор.Проведен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
