#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.ИнтеграцияПодключена И Запись.ИспользоватьФоновыйРежим Тогда
			ЕдиныйНалоговыйСчетИнтеграция.ВключитьАвтоматическиоеОбновлениеДанныхЛичногоКабинета(Запись.Организация);
		Иначе
			ЕдиныйНалоговыйСчетИнтеграция.ОтключитьАвтоматическиоеОбновлениеДанныхЛичногоКабинета(Запись.Организация);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
