#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьДанныеПользователя(ВнутреннийИдентификаторВАТС) Экспорт

	Запрос = Новый Запрос ("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПользователейТелефонии.Пользователь КАК Пользователь,
	|	НастройкиПользователейТелефонии.ВнутреннийНомер КАК ВнутреннийНомер,
	|	НастройкиПользователейТелефонии.ИсходящийНомер КАК ИсходящийНомер,
	|	НастройкиПользователейТелефонии.ВнутреннийИдентификаторВАТС КАК ВнутреннийИдентификаторВАТС
	|ИЗ
	|	РегистрСведений.НастройкиПользователейТелефонии КАК НастройкиПользователейТелефонии
	|ГДЕ
	|	НастройкиПользователейТелефонии.ВнутреннийИдентификаторВАТС = &ВнутреннийИдентификаторВАТС");
	
	Запрос.УстановитьПараметр("ВнутреннийИдентификаторВАТС", ВнутреннийИдентификаторВАТС);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка;

КонецФункции

#КонецОбласти

#КонецЕсли