
#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЭлементыБлокировкиПриСохраненииПравилВыгрузки(Блокировка) Экспорт

	// в базовой реализации не переопределяется

КонецПроцедуры

Процедура ЗаписатьОбъектыДляОбменаПриСохраненииПравилВыгрузки(ОбъектыДляРегистрации) Экспорт

	// в базовой реализации не переопределяется

КонецПроцедуры

Процедура ДобавитьБлокировкуРегистрацияОбъектовДляОбмена(Блокировка, ОбъектыДляРегистрации) Экспорт

	// в базовой реализации не переопределяется

КонецПроцедуры

Процедура ЗаписатьОбъектыДляОбмена(ОбъектыДляРегистрации) Экспорт

	// в базовой реализации не переопределяется

КонецПроцедуры

Функция РассчитатьИзмененияДанныхГрафика(ГрафикиРаботыСотрудников) Экспорт

	// в базовой реализации не переопределяется

КонецФункции

Процедура ОчиститьДанныеПриОтключенииПриложения() Экспорт

	// в базовой реализации не переопределяется

КонецПроцедуры

Процедура ТипыОбъектовДляРучнойРегистрацииИзменений(ТипыОбъектов) Экспорт
	
	// в базовой реализации не переопределяется
	
КонецПроцедуры

#КонецОбласти