#Область ПрограммныйИнтерфейс

Функция НастройкиНУДляФормыДокумента(пФорма, пСтруктураДопДанныхДляВозврата = Неопределено) Экспорт
	
	Если пСтруктураДопДанныхДляВозврата = Неопределено Тогда
		пСтруктураДопДанныхДляВозврата = Новый Структура;
	КонецЕсли;
	
	Элементы = пФорма.Элементы;
	Объект = пФорма.Объект;
	
	СтруктураВозврата = Новый Структура();
	
	Если пСтруктураДопДанныхДляВозврата.Свойство("ВозвращатьТипСтруктурнойЕдиницы")
		И пСтруктураДопДанныхДляВозврата.Свойство("СтруктурнаяЕдиница") Тогда
		ТипСтруктурнойЕдиницы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(пСтруктураДопДанныхДляВозврата.СтруктурнаяЕдиница, "ТипСтруктурнойЕдиницы");
		СтруктураВозврата.Вставить("ТипСтруктурнойЕдиницы", ТипСтруктурнойЕдиницы);
	КонецЕсли;
	
	ВидимостьГруппыУчетВНУДоИзменения = Элементы.ГруппаУчетВНУ.Видимость;
	НоваяВидимостьГруппыУчетВНУДоИзменения = ВидимостьГруппыУчетВНУДоИзменения;
	
	Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Объект.Организация) Тогда
		НоваяВидимостьГруппыУчетВНУДоИзменения = Ложь;
		
		СтруктураВозврата.Вставить("НоваяВидимостьГруппыУчетВНУДоИзменения", НоваяВидимостьГруппыУчетВНУДоИзменения);
		СтруктураВозврата.Вставить("ЭтоЮридическоеЛицо", Истина);
		СтруктураВозврата.Вставить("СистемаНалогообложенияСтруктура", Неопределено);
		Возврат СтруктураВозврата;
	Иначе
		НоваяВидимостьГруппыУчетВНУДоИзменения = Истина;
	КонецЕсли;
	
	СистемаНалогообложенияСтруктура = РегистрыСведений.СистемыНалогообложенияОрганизаций.
	ОпределитьСистемуНалогообложенияОрганизации(Объект.Организация, Объект.Дата);
	
	Если Не СистемаНалогообложенияСтруктура.ПлательщикУСН Тогда
		НоваяВидимостьГруппыУчетВНУДоИзменения = Ложь;
	Иначе
		НоваяВидимостьГруппыУчетВНУДоИзменения = Истина;
	КонецЕсли;
	
	СтруктураВозврата.Вставить("НоваяВидимостьГруппыУчетВНУДоИзменения", НоваяВидимостьГруппыУчетВНУДоИзменения);
	СтруктураВозврата.Вставить("ЭтоЮридическоеЛицо", Ложь);
	СтруктураВозврата.Вставить("СистемаНалогообложенияСтруктура", СистемаНалогообложенияСтруктура);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция определяет тип налогообложения продажи товара налогом на добавленную стоимость.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация, для которой определяется система налогообложения
//	Склад - СправочникСсылка.Склады - Розничный склад, для которой определяется система налогообложения
//	Дата - Дата - Дата определения системы налогообложения
//
// Возвращаемое значение:
// 	ПеречислениеСсылка.ТипыНалогообложенияНДС
Функция НалогообложениеНДС(Организация, Склад = Неопределено, Дата = '00010101') Экспорт

	Запрос = Новый Запрос;

	Если ЗначениеЗаполнено(Дата) Тогда
		Запрос.УстановитьПараметр("Дата", Дата);
	Иначе
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	КонецЕсли;

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС) КАК НалогообложениеНДС
	|ИЗ
	|	РегистрСведений.ПримененияЕНВД.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &Склад) КАК ПримененияЕНВД
	|ГДЕ
	|	ПримененияЕНВД.РозничнаяТорговляОблагаетсяЕНВД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|ИЗ
	|	РегистрСведений.ПримененияПатенты.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &Склад) КАК ПримененияПатенты
	|ГДЕ
	|	ПримененияПатенты.РозничнаяТорговляОблагаетсяПатентом
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК Налогообложение
	|ГДЕ
	|	(Налогообложение.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная)
	|			ИЛИ Налогообложение.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.АУСН)
	|			ИЛИ Налогообложение.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ОсобыйПорядок))";

	НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;

	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НалогообложениеНДС = Выборка.НалогообложениеНДС;
	КонецЕсли;

	Возврат НалогообложениеНДС;

КонецФункции

// Функция определяет тип налогообложения продажи товара налогом на добавленную стоимость.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация, для которой определяется система налогообложения
//	Склад - СправочникСсылка.Склады - Розничный склад, для которой определяется система налогообложения
//	Дата - Дата - Дата определения системы налогообложения
//
// Возвращаемое значение:
// 	ПеречислениеСсылка.СпециальныеНалоговыеРежимы
Функция СпециальныйНалоговыйРежим(Организация, Склад = Неопределено, Дата = '00010101') Экспорт

	Запрос = Новый Запрос;

	Если ЗначениеЗаполнено(Дата) Тогда
		Запрос.УстановитьПараметр("Дата", Дата);
	Иначе
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	КонецЕсли;

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Налогообложение.ПрименяетсяПатент
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпециальныеНалоговыеРежимы.ПСН)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпециальныеНалоговыеРежимы.НеПрименяется)
	|	КОНЕЦ КАК НалоговыйРежим
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК Налогообложение
	|ГДЕ
	|	Налогообложение.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ОсобыйПорядок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СпециальныеНалоговыеРежимы.ПСН)
	|ИЗ
	|	РегистрСведений.ПримененияПатенты.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &Склад) КАК ПримененияПатенты
	|ГДЕ
	|	ПримененияПатенты.РозничнаяТорговляОблагаетсяПатентом";

	НалоговыйРежим = Перечисления.СпециальныеНалоговыеРежимы.НеПрименяется;

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НалоговыйРежим = Выборка.НалоговыйРежим;
	КонецЕсли;

	Возврат НалоговыйРежим;

КонецФункции

// Определяет патент по складу
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Склад - СправочникСсылка.СтруктурныеЕдиницы
//  Дата - Дата
//
// Возвращаемое значение:
// 	СправочникСсылка.Патенты
Функция ПатентПоСкладу(Организация, Склад, Дата) Экспорт

	Патент = Справочники.Патенты.ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПримененияПатентыСрезПоследних.Патент КАК Патент
	|ИЗ
	|	РегистрСведений.ПримененияПатенты.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &Склад
	|				И РозничнаяТорговляОблагаетсяПатентом) КАК ПримененияПатентыСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Патент;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Патент = Выборка.Патент;
	КонецЕсли;

	Возврат Патент;

КонецФункции

// Функция возвращает текст запроса, который получает данные для функции "ПатентПоУмолчаниюДляДенежныхДокументов".
Функция ТекстЗапросаПоПатентамДляЗаполненияНаОснованииРасходнойНаклданой() Экспорт
	
	ТекстЗапроса =
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|"
	+
	"ВЫБРАТЬ
	|	Патенты.Ссылка КАК Патент
	|ИЗ
	|	Справочник.Патенты КАК Патенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО Патенты.Владелец = РасходнаяНакладная.Организация
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &Ссылка
	|	И РасходнаяНакладная.СпециальныйНалоговыйРежим = ЗНАЧЕНИЕ(Перечисление.СпециальныеНалоговыеРежимы.ПСН)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПримененияПатентыСрезПервых.Патент КАК Патент
	|ИЗ
	|	РегистрСведений.ПримененияПатенты.СрезПервых(&Дата, ) КАК ПримененияПатентыСрезПервых
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО ПримененияПатентыСрезПервых.Организация = РасходнаяНакладная.Организация
	|			И ПримененияПатентыСрезПервых.СтруктурнаяЕдиница = РасходнаяНакладная.СтруктурнаяЕдиница
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &Ссылка
	|	И РасходнаяНакладная.СпециальныйНалоговыйРежим = ЗНАЧЕНИЕ(Перечисление.СпециальныеНалоговыеРежимы.ПСН)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция возвращает патент по умолчанию для склада или организации, если для склада патент не задан или склад не выбран.
Функция ПатентПоУмолчаниюДляДенежныхДокументов(пПатентыОрганизации, пПатентыПоСкладам) Экспорт
	
	Патент = Справочники.Патенты.ПустаяСсылка();
	Если пПатентыОрганизации.Количество() = 1 Тогда
		Патент = пПатентыОрганизации[0].Патент;
	ИначеЕсли пПатентыПоСкладам.Количество() = 1 Тогда
		Патент = пПатентыПоСкладам[0].Патент;
	КонецЕсли;
	
	Возврат Патент;
	
КонецФункции

// Процедура заполняет значение реквизита НДС включен в стоимость в документе
//
// Параметры:
//  Документ - ДокументОбъект	 - Документ, в котором необходимо заполнить реквизит НДС включен в стоимость
//
Процедура ЗаполнитьНДСВключенВСтоимостьВДокументе(Документ) Экспорт
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ, "НДСВключатьВСтоимость") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("СебестоимостьБезНДС") Тогда
		
		Если ЗначениеЗаполнено(Документ.Организация) Тогда
			Документ.НДСВключатьВСтоимость = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Организация, "НДСВключатьВСтоимость");
		Иначе
			Документ.НДСВключатьВСтоимость = Истина;
		КонецЕсли;
		
	Иначе
		Документ.НДСВключатьВСтоимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти