////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетЛичныйКабинетПереопределяемый
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОсновнаяОрганизация(ТекущаяОрганизация) Экспорт
	
КонецПроцедуры

Процедура ОсновнаяРегистрацияВНалоговомОргане(Организация, ТекущаяРегистрация) Экспорт
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

Процедура ПодготовитьФормуНаСервере(Форма) Экспорт
	
КонецПроцедуры

Процедура УправлениеФормой(Форма) Экспорт
	
КонецПроцедуры

Процедура УстановитьУсловноеОформление(Форма) Экспорт
	
КонецПроцедуры

Процедура ПолучитьДанныеПлатежи(Параметры) Экспорт
	
КонецПроцедуры

Процедура ПолучитьДанныеОтчеты(Параметры) Экспорт
	
КонецПроцедуры

Процедура ПолучитьДанныеНепроведенныеПлатежи(Параметры) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандПлатежиРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандОтчетыРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандНепроведенныеПлатежиРасхождение(Форма) Экспорт
	
КонецПроцедуры

#КонецОбласти
