////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетЛичныйКабинетКлиентСерверПереопределяемый
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПереключениеКомандПлатежиРасхождение(Форма, ИмяРаздела, ТолькоРасхождения) Экспорт
	
КонецПроцедуры

Процедура ПлатежиОбработатьИзменения(Форма) Экспорт
	
КонецПроцедуры

Процедура ОтчетыОбработатьИзменения(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандОтчетыРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура НепроведенныеПлатежиОбработатьИзменения(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандНепроведенныеПлатежиРасхождение(Форма) Экспорт
	
КонецПроцедуры

#КонецОбласти
