
#Область ПрограммныйИнтерфейс

// Конструктор данных для изменения данных в документе.
// Используется для обработчика См. ДокументыУНФ.ДатаПриИзменении
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой изменяется дата
//  Объект - ДанныеФормыСтруктура - объект, в котором изменяется дата
// 
// Возвращаемое значение:
//  Структура - Данные для изменения даты:
//   * ДатаНеМенялась - Булево - поле Дата не поменялось 
//   * ДатаПередИзменением - Дата - дата перед изменением
//   * ВалютаКурсКратность - см. РаботаСКурсамиВалют.ПолучитьКурсВалюты 
Функция ДанныеДляИзмененияДаты(Форма, Объект) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ДатаНеМенялась", Объект.Дата = Форма.ДатаДокумента);
	Результат.Вставить("ДатаПередИзменением", Форма.ДатаДокумента);
	Результат.Вставить("ВалютаКурсКратность", Новый Структура);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
