///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет структуру параметров запроса для сервера лояльности
//
// Параметры:
//  ОсновныеПараметры - Структура - Структура для заполнения параметров запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыЗапросаКСерверу
//  ЗначенияПараметровЗапроса - Структура - Структура для заполнения ОсновныеПараметры
//
Процедура ЗаполнитьПараметрыСервераЛояльности(ОсновныеПараметры, ЗначенияПараметровЗапроса) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыСервераЛояльности(ОсновныеПараметры, ЗначенияПараметровЗапроса); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса ПолучитьБонусыКлиента
//
// Параметры:
//  ПараметрыМетода - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы
//  ЗначенияПараметровМетода - Структура - Структура для заполнения ПараметрыМетода
//
Процедура ЗаполнитьПараметрыЗапросаПолучитьБонусыКлиента(ПараметрыМетода, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыЗапросаПолучитьБонусыКлиента(ПараметрыМетода, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса РазблокироватьБонусыКлиента
//
// Параметры:
//  ПараметрыМетода - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы
//  ЗначенияПараметровМетода - Структура - Структура для заполнения ПараметрыМетода
//
Процедура ЗаполнитьПараметрыЗапросаРазблокироватьБонусыКлиента(ПараметрыМетода, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыЗапросаРазблокироватьБонусыКлиента(ПараметрыМетода, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса СписатьБонусыКлиента
//
// Параметры:
//  ПараметрыМетода - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы
//  ЗначенияПараметровМетода - Структура - Структура для заполнения ПараметрыМетода
//
Процедура ЗаполнитьПараметрыЗапросаСписатьБонусыКлиента(ПараметрыМетода, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыЗапросаСписатьБонусыКлиента(ПараметрыМетода, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса ВыдатьКартуКлиенту
//
// Параметры:
//  ПараметрыМетода - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы
//  ЗначенияПараметровМетода - Структура - Структура для заполнения ПараметрыМетода
//
Процедура ЗаполнитьПараметрыЗапросаВыдатьКартуКлиенту(ПараметрыМетода, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыЗапросаВыдатьКартуКлиенту(ПараметрыМетода, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса ИнформацияОЗапретахПродаж
//
// Параметры:
//  ПараметрыМетода - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы
//  ЗначенияПараметровМетода - Структура - Структура для заполнения ПараметрыМетода
//
Процедура ЗаполнитьПараметрыЗапросаДанныеЗапретовРедактирования(ПараметрыМетода, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыЗапросаДанныеЗапретовРедактирования(ПараметрыМетода, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса ПолучитьДанныеПодарочногоСертификата
//
// Параметры:
//  ПараметрыМетода - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы
//  ЗначенияПараметровМетода - Структура - Структура для заполнения ПараметрыМетода
//
Процедура ЗаполнитьПараметрыЗапросаПолучитьДанныеПодарочногоСертификата(ПараметрыМетода, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыЗапросаПолучитьДанныеПодарочногоСертификата(ПараметрыМетода, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса ПолучитьДанныеПромокода
//
// Параметры:
//  ПараметрыМетода - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы
//  ЗначенияПараметровМетода - Структура - Структура для заполнения ПараметрыМетода
//
Процедура ЗаполнитьПараметрыЗапросаПолучитьДанныеПромокода(ПараметрыМетода, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыЗапросаПолучитьДанныеПромокода(ПараметрыМетода, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса РазблокироватьПромокод
//
// Параметры:
//  ПараметрыМетода - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы
//  ЗначенияПараметровМетода - Структура - Структура для заполнения ПараметрыМетода
//
Процедура ЗаполнитьПараметрыЗапросаРазблокироватьПромокод(ПараметрыМетода, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыЗапросаРазблокироватьПромокод(ПараметрыМетода, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса РазблокироватьПодарочныйСертификат
//
// Параметры:
//  ПараметрыМетода - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы
//  ЗначенияПараметровМетода - Структура - Структура для заполнения ПараметрыМетода
//
Процедура ЗаполнитьПараметрыЗапросаРазблокироватьПодарочныйСертификат(ПараметрыМетода, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыЗапросаРазблокироватьПодарочныйСертификат(ПараметрыМетода, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса СписатьПодарочныйСертификат
//
// Параметры:
//  ПараметрыМетода - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы
//  ЗначенияПараметровМетода - Структура - Структура для заполнения ПараметрыМетода
//
Процедура ЗаполнитьПараметрыЗапросаСписатьПодарочныйСертификат(ПараметрыМетода, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыЗапросаСписатьПодарочныйСертификат(ПараметрыМетода, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса ПогаситьПромокод
//
// Параметры:
//  ПараметрыМетода - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы
//  ЗначенияПараметровМетода - Структура - Структура для заполнения ПараметрыМетода
//
Процедура ЗаполнитьПараметрыЗапросаПогаситьПромокод(ПараметрыМетода, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыЗапросаПогаситьПромокод(ПараметрыМетода, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса АктивироватьПромокод
//
// Параметры:
//  ПараметрыМетода - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.ПараметрыМетодовБонуснойПодсистемы
//  ЗначенияПараметровМетода - Структура - Структура для заполнения ПараметрыМетода
//
Процедура ЗаполнитьПараметрыЗапросаАктивироватьПромокод(ПараметрыМетода, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыЗапросаАктивироватьПромокод(ПараметрыМетода, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса РассчитатьАвтоматическиеСкидки
//
// Параметры:
//  СтруктураПараметровРасчетаСкидок - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.СтруктураПараметровРасчетаСкидок
//  ЗначенияПараметровМетода - Структура - Структура для заполнения СтруктураПараметровРасчетаСкидок
//
Процедура ЗаполнитьСтруктуруПараметровРасчетаСкидок(СтруктураПараметровРасчетаСкидок, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьСтруктуруПараметровРасчетаСкидок(СтруктураПараметровРасчетаСкидок, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру ссылки для передачи серверу лояльности
//
// Параметры:
//  СтруктураСсылки - Структура - Структура ссылки см. СерверЛояльностиПолучательДанныхКлиентСервер.ПолучитьСтруктуруСсылки
//  Ссылка - ЛюбаяСсылка
//
Процедура ЗаполнитьСтруктуруСсылки(СтруктураСсылки, Ссылка) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьСтруктуруСсылки(СтруктураСсылки, Ссылка); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет код основного языка конфигурации, например "ru".
//
// Параметры:
//  КодОсновногоЯзыка - Строка
//
Процедура ЗаполнитьКодОсновногоЯзыка(КодОсновногоЯзыка) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьКодОсновногоЯзыка(КодОсновногоЯзыка); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет список управляемых скидок
//
// Параметры:
//  Результат - ТаблицаЗначений - возвращаемое значение
//
Процедура ЗаполнитьТаблицуУправляемыхСкидок(Результат) Экспорт
	
	СерверЛояльностиПоставщикДанныхУНФ.ЗаполнитьТаблицуУправляемыхСкидок(Результат); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет структуру параметров метода запроса ПолучитьОстатки
//
// Параметры:
//  ПараметрыМетода - Структура - Структура для заполнения параметров метода запроса к серверу см. СерверЛояльностиПолучательДанныхКлиентСервер.СтруктураПараметровПолученияОстатков
//  ЗначенияПараметровМетода - Структура - Структура для заполнения ПараметрыМетода
//
Процедура ЗаполнитьПараметрыЗапросаПолучитьОстатки(ПараметрыМетода, ЗначенияПараметровМетода) Экспорт
	
	СерверЛояльностиПолучательДанныхКлиентСерверУНФ.ЗаполнитьПараметрыЗапросаПолучитьОстатки(ПараметрыМетода, ЗначенияПараметровМетода); // НЕ БСЛ
	
КонецПроцедуры

// Заполняет список видов карт
//
// Параметры:
//  Результат - ТаблицаЗначений - возвращаемое значение
//
Процедура ЗаполнитьТаблицуВидовКарт(Результат) Экспорт
	
	СерверЛояльностиПоставщикДанныхУНФ.ЗаполнитьТаблицуВидовКарт(Результат); // НЕ БСЛ
	
КонецПроцедуры

#КонецОбласти