#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("БонуснаяКарта") Тогда
		БонуснаяКарта = Параметры.БонуснаяКарта;
	КонецЕсли;
	
	Документ = Неопределено;
	Если Не Параметры.Свойство("Документ", Документ) Тогда
		Возврат;
	КонецЕсли;
	СуммаДокумента = Документ.СуммаДокумента;
	СуммаУжеПримененныхБонусов = 0;
	Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
		Если Документ.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
			СуммаДокумента = Документ.Запасы.Итог("Всего") + Документ.Работы.Итог("Всего");
		  	СуммаУжеПримененныхБонусов = Документ.Запасы.Итог("СуммаСкидкиОплатыБонусом") + Документ.Работы.Итог("СуммаСкидкиОплатыБонусом");
		Иначе
			НомерВарианта = Документ.ОсновнойВариантКП;
			ОтборКП = Новый Структура("НомерВариантаКП", НомерВарианта);
			СтрокиКП = Документ.Запасы.НайтиСтроки(ОтборКП);			 
			ЗапасыОсновногоКП = Документ.Запасы.Выгрузить(СтрокиКП, "Всего, СуммаСкидкиОплатыБонусом");
			СуммаДокумента = ЗапасыОсновногоКП.Итог("Всего");
			СуммаУжеПримененныхБонусов = ЗапасыОсновногоКП.Итог("СуммаСкидкиОплатыБонусом");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		СуммаДокумента = Документ.РаботыИУслуги.Итог("Всего");
	  	СуммаУжеПримененныхБонусов = Документ.РаботыИУслуги.Итог("СуммаСкидкиОплатыБонусом");
	Иначе						 
		СуммаУжеПримененныхБонусов = Документ.Запасы.Итог("СуммаСкидкиОплатыБонусом");
	КонецЕсли;
	
	СуммаДокумента = СуммаДокумента + СуммаУжеПримененныхБонусов;
	Если Не ЗначениеЗаполнено(БонуснаяКарта) Тогда
		БонуснаяКарта = Документ.ДисконтнаяКарта;
	КонецЕсли;
	
	Если Параметры.Свойство("КОплате") Тогда
		КОплате = Параметры.КОплате;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("СуммаБонусов") Тогда
		СуммаОплаты = Параметры.СуммаБонусов;
	КонецЕсли;
	
	Если Не Документ = Неопределено Тогда
		
		// Получим максимальный процент оплаты
		ОграничениеОплаты = РаботаСБонусами.ОпределитьОграничениеОплаты(Документ.ДисконтнаяКарта, СуммаДокумента);
		
		// Получим остаток и владельца
		СтруктураДанных = РаботаСБонусами.ПолучитьДанныеБонуснойКарты(Документ.ДисконтнаяКарта, Документ.Дата);
		Остаток = СтруктураДанных.Остаток;
		СтруктураОстатка.Загрузить(СтруктураДанных.ТаблицаДвижений);
		Владелец = СтруктураДанных.Владелец;
		
	КонецЕсли;
	
	МинимальнаяСумма = Мин(Остаток, КОплате, ОграничениеОплаты);
	
	Если Остаток = МинимальнаяСумма Тогда
		Элементы.СуммаОплаты.СписокВыбора.Добавить(Остаток, СтрШаблон(НСтр("ru = '%1 (Остаток)'"), Остаток));
	ИначеЕсли КОплате = МинимальнаяСумма Тогда
		Элементы.СуммаОплаты.СписокВыбора.Добавить(КОплате, СтрШаблон(НСтр("ru = '%1 (К оплате)'"), КОплате));
	ИначеЕсли ОграничениеОплаты = МинимальнаяСумма Тогда
		Элементы.СуммаОплаты.СписокВыбора.Добавить(ОграничениеОплаты, СтрШаблон(НСтр("ru = '%1 (Макс.)'"),
			ОграничениеОплаты));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если СуммаОплаты > Остаток Тогда
		ТекстСообщения = НСтр("ru = 'Превышен остаток баллов по карте!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СуммаОплаты", "СуммаОплаты");
		Возврат;
	КонецЕсли;
	
	Если СуммаОплаты > КОплате Тогда
		ТекстСообщения = НСтр("ru = 'Сумма оплаты не может превышать сумму документа!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СуммаОплаты", "СуммаОплаты");
		Возврат;
	КонецЕсли;
	
	Если СуммаОплаты > ОграничениеОплаты Тогда
		ТекстСообщения = НСтр("ru = 'Сумма оплаты не может превышать ограничение, установленное для бонусной программы!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СуммаОплаты", "СуммаОплаты");
		Возврат;
	КонецЕсли;
	
	Если СуммаОплаты = 0 Тогда
		ПараметрыЗакрытия = Неопределено;
	Иначе
		ПараметрыЗакрытия = Новый Структура("БонуснаяКарта, СуммаБонусов, ВидОплаты, ЕстьОплатаБонусами",
			БонуснаяКарта,
			СуммаОплаты,
			ПредопределенноеЗначение("Перечисление.ВидыБезналичныхОплат.Бонусы"),
			Истина);
	КонецЕсли;
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти
