#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
Процедура ЛетДоУничтоженияПерсональныхДанныхСотрудниковПриИзменении(Форма) Экспорт
	
	КоличествоЛет = Форма.ЛетДоУничтоженияПерсональныхДанныхСотрудников; // Число
	ЗарплатаКадрыВызовСервера.УстановитьЗначениеКонстанты("ЛетДоУничтоженияПерсональныхДанныхСотрудников",
		КоличествоЛет);
	Форма.Элементы.ПолеЛетДоУничтоженияПерсональныхДанныхСотрудников.Заголовок =
		СтрРазделить(ЗарплатаКадрыКлиентСервер.ПредставлениеЛет(КоличествоЛет), " ")[1];
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Оповестить("Запись_НаборКонстант", Новый Структура, "ЛетДоУничтоженияПерсональныхДанныхСотрудников");
	
КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения - настраиваемая форма.
Процедура НастройкиУничтоженияПерсональныхДанныхПриИзменении(Форма) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ЛетДоУничтоженияПерсональныхДанныхСотрудниковГруппа",
		"Видимость",
		Форма.НаборКонстант.ИспользоватьСкрытиеПерсональныхДанныхСубъектов);
	
КонецПроцедуры
	
#КонецОбласти
