#Область ПрограммныйИнтерфейс

Функция ПроверитьКонтрольныеСоотношенияВОтчете(Форма, Ссылка) Экспорт
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.УведомлениеОСпецрежимахНалогообложения") Тогда
		Возврат Новый Структура("Статус", "Отменено");
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ДатаПодписи,ВидУведомления,ИмяФормы");
	Если Реквизиты.ИмяФормы <> "Форма2023_1" 
		Или Реквизиты.ВидУведомления <> Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ИсчисленныеСуммыНалогов Тогда
		
		Возврат Новый Структура("Статус", "Отменено");
	КонецЕсли;
	
	КонтекстПроверки = КонтекстПроверки();
	КонтекстПроверки.Документирование = Ложь;
	КонтекстПроверки.ТаблицаРезультата = Отчеты.ПроверкаКонтрольныхСоотношений.СформироватьТаблицуРезультата();
	КонтекстПроверки.ТаблицаРасшифровки = Отчеты.ПроверкаКонтрольныхСоотношений.СформироватьТаблицуРасшифровки();
	КонтекстПроверки.ДанныеКС = Новый Структура;
	КонтекстПроверки.ДанныеКС.Вставить("Счетчик", 0);
	КонтекстПроверки.ДанныеКС.Вставить("ЧислоОшибок", 0);
	КонтекстПроверки.ДанныеКС.Вставить("Отчет", Ссылка);
	КонтекстПроверки.ДанныеКС.Вставить("ГодОтчета", Год(Реквизиты.ДатаПодписи));
	КонтекстПроверки.ДанныеКС.Вставить("МесОтчета", Месяц(Реквизиты.ДатаПодписи));
	КонтекстПроверки.ДанныеКС.Вставить("ТолькоОшибки", Истина);
	КонтекстПроверки.ДанныеКС.Вставить("МакетСКП", "Базовая_1");
	КонтекстПроверки.ДанныеКС.Вставить("ВариантСКП", "ПоРазделам_1_1");
	КонтекстПроверки.ДанныеКС.Вставить("АдресРезультата");
	КонтекстПроверки.ДанныеКС.Вставить("АдресРасшифровки");
	
	СформироватьСлужебныеДанные(КонтекстПроверки);
	СформироватьДанныеОтчета(КонтекстПроверки, Ссылка);
	
	Если Реквизиты.ИмяФормы = "Форма2023_1" Тогда 
		Проверить_2023(КонтекстПроверки);
	КонецЕсли;
	
	РегламентированнаяОтчетность.ПоместитьВКэш(КонтекстПроверки.ТаблицаРезультата, Форма.УникальныйИдентификатор,
		КонтекстПроверки.ДанныеКС.АдресРезультата);
	РегламентированнаяОтчетность.ПоместитьВКэш(КонтекстПроверки.ТаблицаРасшифровки, Форма.УникальныйИдентификатор,
		КонтекстПроверки.ДанныеКС.АдресРасшифровки);
		
	Возврат ПодготовитьРезультат(КонтекстПроверки, Реквизиты.ВидУведомления);
КонецФункции

Функция ВыполнитьДокументированиеНаСервере(Форма, Ссылка) Экспорт 
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.УведомлениеОСпецрежимахНалогообложения") Тогда
		Возврат Новый Структура("НаименованиеОтчета,НаименованиеФормы,ДатаФормирования,АдресТаблицыОписаний");
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ДатаПодписи,ВидУведомления,ИмяФормы");
	//Если Реквизиты.ИмяФормы <> "Форма2023_1" 
	//	Или Реквизиты.ВидУведомления <> Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ИсчисленныеСуммыНалогов Тогда
	//	
	//	Возврат Новый Структура("НаименованиеОтчета,НаименованиеФормы,ДатаФормирования,АдресТаблицыОписаний");
	//КонецЕсли;
	
	КонтекстПроверки = КонтекстПроверки();
	КонтекстПроверки.Документирование = Истина;
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("НаименованиеОтчета"	, "Уведомление об исчисленных суммах налогов");
	СтруктураРезультата.Вставить("НаименованиеФормы"	, "Форма2023_1");
	СтруктураРезультата.Вставить("ДатаФормирования"		, Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
	
	КонтекстПроверки.ТаблицаОписаний = Отчеты.ПроверкаКонтрольныхСоотношений.СформироватьТаблицуОписаний();
	КонтекстПроверки.ДанныеКС = Новый Структура;
	КонтекстПроверки.ДанныеКС.Вставить("Счетчик", 0);
	СформироватьСлужебныеДанные(КонтекстПроверки);
	СформироватьПриоритетыРазделов(КонтекстПроверки);
	
	//Если Реквизиты.ИмяФормы = "Форма2023_1" Тогда 
		Проверить_2023(КонтекстПроверки);
	//КонецЕсли;
	
	АдресТаблицыОписаний = ПоместитьВоВременноеХранилище(КонтекстПроверки.ТаблицаОписаний, Новый УникальныйИдентификатор);
	СтруктураРезультата.Вставить("АдресТаблицыОписаний", АдресТаблицыОписаний);
	
	Возврат СтруктураРезультата;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КонтекстПроверки()
	Результат = Новый Структура;
	Результат.Вставить("ДанныеКС");
	Результат.Вставить("НастройкиКС");
	Результат.Вставить("ТаблицаРезультата");
	Результат.Вставить("ТаблицаРасшифровки");
	Результат.Вставить("Документирование");
	Результат.Вставить("ТаблицаОписаний");
	Возврат Результат;
КонецФункции

Функция ПодготовитьРезультат(КонтекстПроверки, ВидУведомления)
	СтруктураРезультата = Новый Структура;
	
	СтруктураРезультата.Вставить("АдресТаблицыРезультата", КонтекстПроверки.ДанныеКС.АдресРезультата);
	СтруктураРезультата.Вставить("АдресТаблицыРасшифровки", КонтекстПроверки.ДанныеКС.АдресРасшифровки);
	СтруктураРезультата.Вставить("ЧислоОшибок", КонтекстПроверки.ДанныеКС.ЧислоОшибок);
	СтруктураРезультата.Вставить("ТекстЗаголовка", Строка(ВидУведомления));
	СтруктураРезультата.Вставить("МакетСКП", КонтекстПроверки.ДанныеКС.МакетСКП);
	СтруктураРезультата.Вставить("ВариантСКП", КонтекстПроверки.ДанныеКС.ВариантСКП);
	
	Возврат СтруктураРезультата;
КонецФункции

Процедура СформироватьСлужебныеДанные(КонтекстПроверки)

#Область Служебные_данные
	ИменаРазделов = Новый Структура();
	ИменаРазделов.Вставить("Р0", "Титульная_2023");
	ИменаРазделов.Вставить("Р1", "СумИсчНалог_2023");
	КонтекстПроверки.ДанныеКС.Вставить("ИменаРазделов", ИменаРазделов);
	
	ПредставленияРазделов = Новый Структура();
	ПредставленияРазделов.Вставить("Р0", "Титульный лист");
	ПредставленияРазделов.Вставить("Р1", "");
	КонтекстПроверки.ДанныеКС.Вставить("ПредставленияРазделов", ПредставленияРазделов);
	
	ЦелочисленныеРазделы = Новый Массив;
	КонтекстПроверки.ДанныеКС.Вставить("ЦелочисленныеРазделы", ЦелочисленныеРазделы);
	
	СоответствиеСписков = Новый Соответствие;
	КонтекстПроверки.ДанныеКС.Вставить("СоответствиеСписков", СоответствиеСписков);
	
	СформироватьПриоритетыРазделов(КонтекстПроверки);
	
	ПредставленияПоказателей = Новый Соответствие;
	ПредставленияПоказателей.Вставить("КППДекл"			, "КПП");
	ПредставленияПоказателей.Вставить("ОКТМО"			, "ОКТМО");
	ПредставленияПоказателей.Вставить("КБК"				, "КБК");
	ПредставленияПоказателей.Вставить("СумНалогАванс"	, "Сумма налога");
	ПредставленияПоказателей.Вставить("Период"			, "Код периода");
	ПредставленияПоказателей.Вставить("НомерМесКварт"	, "Номер месяца (квартала)");
	ПредставленияПоказателей.Вставить("Год"				, "Отчетный (календарный) год");
	ПредставленияПоказателей.Вставить("ДАТА_ПОДПИСИ"	, "Дата подписи");
	КонтекстПроверки.ДанныеКС.Вставить("ПредставленияПоказателей", ПредставленияПоказателей);
	
	ЗначенияПоУмолчанию = Новый Соответствие;
	ЗначенияПоУмолчанию.Вставить("КППДекл"			, "");
	ЗначенияПоУмолчанию.Вставить("ОКТМО"			, "");
	ЗначенияПоУмолчанию.Вставить("КБК"				, "");
	ЗначенияПоУмолчанию.Вставить("СумНалогАванс"	, 0);
	ЗначенияПоУмолчанию.Вставить("Период"			, "");
	ЗначенияПоУмолчанию.Вставить("НомерМесКварт"	, "");
	ЗначенияПоУмолчанию.Вставить("Год"				, "");
	КонтекстПроверки.ДанныеКС.Вставить("ЗначенияПоУмолчанию", ЗначенияПоУмолчанию);

#КонецОбласти

#Область КБК

	СтруктураКБК = Новый Структура();
	СтруктураКБК.Вставить("Прибыль_Ин"			, "18210101030011000110");
	СтруктураКБК.Вставить("Прибыль_Див_РосРос"	, "18210101040011000110");
	СтруктураКБК.Вставить("Прибыль_Див_РосИн"	, "18210101050011000110");
	СтруктураКБК.Вставить("Прибыль_Проц"		, "18210101070011000110");
	СтруктураКБК.Вставить("НДФЛ_НА"				, "18210102010011000110");
	СтруктураКБК.Вставить("НДФЛ_ИП"				, "18210102020011000110");
	СтруктураКБК.Вставить("НДФЛ_КИК"			, "18210102050011000110");
	СтруктураКБК.Вставить("НДФЛ_Проц"			, "18210102070011000110");
	СтруктураКБК.Вставить("НДФЛ_650тр"			, "18210102080011000110");
	СтруктураКБК.Вставить("НДФЛ_КИК_Особ"		, "18210102090011000110");
	СтруктураКБК.Вставить("НДФЛ_КИК_650тр"		, "18210102100011000110");
	СтруктураКБК.Вставить("НДФЛ_КИК_Особ_650тр"	, "18210102110011000110");
	СтруктураКБК.Вставить("НДФЛ_5_000тр"		, "18210102120011000110");
	СтруктураКБК.Вставить("НДФЛ_Долевой"		, "18210102130011000110");
	СтруктураКБК.Вставить("НДФЛ_Долевой_650тр"	, "18210102140011000110");
	СтруктураКБК.Вставить("СВ"					, "18210201000011000160");
	СтруктураКБК.Вставить("СВ_Доптариф_1"		, "18210204010011010160");
	СтруктураКБК.Вставить("СВ_Доптариф_3"		, "18210204010011020160");
	СтруктураКБК.Вставить("СВ_Доптариф_2"		, "18210204020011010160");
	СтруктураКБК.Вставить("СВ_Доптариф_4"		, "18210204020011020160");
	СтруктураКБК.Вставить("СВ_Летчики"			, "18210208000061000160");
	СтруктураКБК.Вставить("СВ_Уголь"			, "18210209000061000160");
	СтруктураКБК.Вставить("СВ_Судьи_СоцСтрах"	, "18210210000011000160");
	СтруктураКБК.Вставить("СВ_Судьи_ОМС"		, "18210211000011000160");
	СтруктураКБК.Вставить("УСН_Доходы"			, "18210501011011000110");
	СтруктураКБК.Вставить("УСН_Расходы"			, "18210501021011000110");
	СтруктураКБК.Вставить("ЕСХН"				, "18210503010011000110");
	СтруктураКБК.Вставить("Имущество"			, "18210602010021000110");
	СтруктураКБК.Вставить("Имущество_ЕСГ"		, "18210602020021000110");
	СтруктураКБК.Вставить("Транспортный"		, "18210604011021000110");
	СтруктураКБК.Вставить("Земля_муниц_фед"		, "18210606031031000110");
	СтруктураКБК.Вставить("Земля_ГО"			, "18210606032041000110");
	СтруктураКБК.Вставить("Земля_ГО_деление"	, "18210606032111000110");
	СтруктураКБК.Вставить("Земля_ГР"			, "18210606032121000110");
	СтруктураКБК.Вставить("Земля_муниц"			, "18210606032141000110");
	СтруктураКБК.Вставить("Земля_МТ"			, "18210606033051000110");
	СтруктураКБК.Вставить("Земля_СП"			, "18210606033101000110");
	СтруктураКБК.Вставить("Земля_ГП"			, "18210606033131000110");
	КонтекстПроверки.ДанныеКС.Вставить("КБК", СтруктураКБК);

#КонецОбласти

#Область Комплекты_КБК

	КомплектыКБК = Новый Структура;
	
	Комплект_НДФЛ_1 = Новый Массив;
	Комплект_НДФЛ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_НА);
	Комплект_НДФЛ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_Проц);
	Комплект_НДФЛ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_650тр);
	Комплект_НДФЛ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_Долевой);
	Комплект_НДФЛ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_Долевой_650тр);
	
	КомплектыКБК.Вставить("Комплект_НДФЛ_1", Комплект_НДФЛ_1);
	
	Комплект_НДФЛ_2 = Новый Массив;
	Комплект_НДФЛ_2.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_НА);
	Комплект_НДФЛ_2.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_ИП);
	Комплект_НДФЛ_2.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_КИК);
	Комплект_НДФЛ_2.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_Проц);
	Комплект_НДФЛ_2.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_650тр);
	Комплект_НДФЛ_2.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_КИК_Особ);
	Комплект_НДФЛ_2.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_КИК_650тр);
	Комплект_НДФЛ_2.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_КИК_Особ_650тр);
	Комплект_НДФЛ_2.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_5_000тр);
	Комплект_НДФЛ_2.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_Долевой);
	Комплект_НДФЛ_2.Добавить(КонтекстПроверки.ДанныеКС.КБК.НДФЛ_Долевой_650тр);
	
	КомплектыКБК.Вставить("Комплект_НДФЛ_2", Комплект_НДФЛ_2);
	
	Комплект_РСВ_1 = Новый Массив;
	Комплект_РСВ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.СВ);
	Комплект_РСВ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.СВ_Уголь);
	Комплект_РСВ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.СВ_Летчики);
	Комплект_РСВ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.СВ_Доптариф_1);
	Комплект_РСВ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.СВ_Доптариф_2);
	Комплект_РСВ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.СВ_Доптариф_3);
	Комплект_РСВ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.СВ_Доптариф_4);
	Комплект_РСВ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.СВ_Судьи_СоцСтрах);
	Комплект_РСВ_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.СВ_Судьи_ОМС);
	
	КомплектыКБК.Вставить("Комплект_РСВ_1", Комплект_РСВ_1);
	
	Комплект_УСН_1 = Новый Массив;
	Комплект_УСН_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.УСН_Доходы);
	Комплект_УСН_1.Добавить(КонтекстПроверки.ДанныеКС.КБК.УСН_Расходы);
	
	КомплектыКБК.Вставить("Комплект_УСН_1", Комплект_УСН_1);
	
	Комплект_Имущество = Новый Массив;
	Комплект_Имущество.Добавить(КонтекстПроверки.ДанныеКС.КБК.Имущество);
	Комплект_Имущество.Добавить(КонтекстПроверки.ДанныеКС.КБК.Имущество_ЕСГ);
	
	КомплектыКБК.Вставить("Комплект_Имущество", Комплект_Имущество);
	
	Комплект_Земля = Новый Массив;
	Комплект_Земля.Добавить(КонтекстПроверки.ДанныеКС.КБК.Земля_муниц_фед);
	Комплект_Земля.Добавить(КонтекстПроверки.ДанныеКС.КБК.Земля_ГО);
	Комплект_Земля.Добавить(КонтекстПроверки.ДанныеКС.КБК.Земля_ГО_деление);
	Комплект_Земля.Добавить(КонтекстПроверки.ДанныеКС.КБК.Земля_ГР);
	Комплект_Земля.Добавить(КонтекстПроверки.ДанныеКС.КБК.Земля_муниц);
	Комплект_Земля.Добавить(КонтекстПроверки.ДанныеКС.КБК.Земля_МТ);
	Комплект_Земля.Добавить(КонтекстПроверки.ДанныеКС.КБК.Земля_СП);
	Комплект_Земля.Добавить(КонтекстПроверки.ДанныеКС.КБК.Земля_ГП);
	
	КомплектыКБК.Вставить("Комплект_Земля", Комплект_Земля);
	
	КонтекстПроверки.ДанныеКС.Вставить("КомплектыКБК", КомплектыКБК);

#КонецОбласти

КонецПроцедуры

Процедура СформироватьПриоритетыРазделов(КонтекстПроверки)
	ПриоритетыРазделов = Новый Массив;
	ПриоритетыРазделов.Добавить("Сведения о суммах налогов");
	КонтекстПроверки.ДанныеКС.Вставить("ПриоритетыРазделов", ПриоритетыРазделов);
КонецПроцедуры

Процедура СформироватьДанныеОтчета(КонтекстПроверки, Ссылка)
	ИсходнаяСтруктура = Ссылка.ДанныеУведомления.Получить();
	
	КонтекстПроверки.ДанныеКС.Вставить("Р0", ОбщегоНазначения.СкопироватьРекурсивно(
		ИсходнаяСтруктура.ДанныеУведомления.Титульная));
	КонтекстПроверки.ДанныеКС.Р0.Вставить("ДатаПодписи2", Формат(КонтекстПроверки.ДанныеКС.Р0.ДАТА_ПОДПИСИ, "ДФ=MMdd; ДП=0000"));
	КонтекстПроверки.ДанныеКС.Р0.Вставить("ДатаПодписи3", Формат(КонтекстПроверки.ДанныеКС.Р0.ДАТА_ПОДПИСИ, "ДФ=dd.MM; ДП=00.00"));
	КонтекстПроверки.ДанныеКС.Р0.Вставить("ГодПодписи", Формат(КонтекстПроверки.ДанныеКС.Р0.ДАТА_ПОДПИСИ, "ДФ=yyyy; ДП=(...)"));
	
	Р1 = Новый Массив;
	Для каждого Элемент Из ИсходнаяСтруктура.ДанныеМногостраничныхРазделов.СумИсчНалог Цикл
		СтраницаРаздела = ОбщегоНазначения.СкопироватьРекурсивно(Элемент.Значение);
		СтраницаРаздела.Вставить("НомерСтраницы", 
			"Стр. " + XMLСтрока((ИсходнаяСтруктура.ДанныеМногостраничныхРазделов.СумИсчНалог.Индекс(Элемент) + 1)));
		СформироватьКодПериода(СтраницаРаздела);
		Р1.Добавить(СтраницаРаздела);
	КонецЦикла;
	
	КонтекстПроверки.ДанныеКС.Вставить("Р1", Р1);
КонецПроцедуры

Процедура СформироватьКодПериода(СтраницаРаздела)
	ПериодРаздела = ?(ЗначениеЗаполнено(СтраницаРаздела.Период), СтраницаРаздела.Период, "(...)");
	НомерМесяца = ?(ЗначениеЗаполнено(СтраницаРаздела.НомерМесКварт), СтраницаРаздела.НомерМесКварт, "(...)");
	СтраницаРаздела.Вставить("КодПериода", ПериодРаздела + "/" + НомерМесяца);
КонецПроцедуры

Процедура ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатель, Источник, НомерСтроки = Неопределено)
	Если Показатель.Заполнять Тогда
		ЗаполнитьПоказатель(КонтекстПроверки, Показатель, Источник, НомерСтроки);
		
		Если Показатель.Расшифровывать Тогда
			РасшифроватьПоказатель(КонтекстПроверки, Показатель);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоказатель(КонтекстПроверки, Показатель, Источник, НомерСтроки = Неопределено)
	Перем ЗначениеВИсточнике;
	
	Если ТипЗнч(НомерСтроки) = Тип("Массив") Тогда
		НомерСтроки = СтрСоединить(НомерСтроки, "_");
	КонецЕсли; 
	
	Если ТипЗнч(Источник) = Тип("Структура") Тогда
		Если ЗначениеЗаполнено(НомерСтроки) Тогда
			Показатель.ИмяПоказателя = Лев(Показатель.ИмяПоказателя, 14) + НомерСтроки;
		КонецЕсли;
		
		ЗначениеВИсточнике = Источник[Показатель.ИмяПоказателя];
		
		Если ЗначениеВИсточнике = Неопределено Тогда
			ЗначениеВИсточнике = КонтекстПроверки.ДанныеКС.ЗначенияПоУмолчанию.Получить(Показатель.ИмяПоказателя);
		КонецЕсли; 
		
		Показатель.НомерСтраницы = ?(Источник.Свойство("НомерСтраницы"), Источник.НомерСтраницы, "");
		ЗаполнитьПоказательЗначениями(Показатель, ЗначениеВИсточнике);
	ИначеЕсли ТипЗнч(Источник) = Тип("ВыборкаИзРезультатаЗапроса") Тогда
		ЗначениеВИсточнике = Источник[Показатель.Синоним];
		
		Показатель.Отчет			= КонтекстПроверки.ДанныеКС.Отчет;
		Показатель.НомерСтраницы 	= Источник.НомерСтраницы;
			
		ЗаполнитьПоказательЗначениями(Показатель, ЗначениеВИсточнике);
		
		Если ЗначениеЗаполнено(НомерСтроки) Тогда
			Показатель.ИмяПоказателя = Лев(Показатель.ИмяПоказателя, 14) + НомерСтроки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура РасшифроватьПоказатель(КонтекстПроверки, Показатель)
		
	НоваяСтрока							= КонтекстПроверки.ТаблицаРасшифровки.Добавить();
	НоваяСтрока.НомерЭлемента			= КонтекстПроверки.ДанныеКС.Счетчик;
	
	НоваяСтрока.СсылкаНаОтчет			= ?(ЗначениеЗаполнено(Показатель.Отчет), 
		Показатель.Отчет, КонтекстПроверки.ДанныеКС.Отчет);
	НоваяСтрока.ИмяРаздела				= Показатель.ИмяРаздела;
	НоваяСтрока.ИмяПоказателя			= Показатель.ИмяПоказателя;
	НоваяСтрока.НомерСтраницы			= Показатель.НомерСтраницы;
	
	НоваяСтрока.ПредставлениеПоказателя = ?(ЗначениеЗаполнено(Показатель.Дополнение), 
		Показатель.Представление + ", (" + Показатель.Дополнение + ")", Показатель.Представление);
	
	Если ТипЗнч(Показатель.Значение) = Тип("Число") Тогда
		НоваяСтрока.ЗначениеПоказателя		= Показатель.Значение;
	Иначе
		НоваяСтрока.ЗначениеПоказателя		= Показатель.ЗначениеСтр;
	КонецЕсли;
	
	Показатель.Дополнение = "";
	
КонецПроцедуры

Процедура ЗаполнитьПоказательЗначениями(Показатель, ЗначениеВИсточнике)
	Если ТипЗнч(ЗначениеВИсточнике) = Тип("Число") Тогда
		Показатель.Значение = ЗначениеВИсточнике;
		Показатель.Итог = Показатель.Итог + ЗначениеВИсточнике;
	ИначеЕсли ТипЗнч(ЗначениеВИсточнике) = Тип("Строка") Тогда
		Показатель.Значение = СокрЛП(ЗначениеВИсточнике);
		Показатель.ЗначениеСтр = ?(ЗначениеЗаполнено(ЗначениеВИсточнике), Показатель.Значение, "(...)");
	ИначеЕсли ТипЗнч(ЗначениеВИсточнике) = Тип("Дата") Тогда
		Показатель.Значение = ЗначениеВИсточнике;
		Показатель.ЗначениеСтр = Формат(ЗначениеВИсточнике, "ДФ=dd.MM.yy; ДП=(...)");
	КонецЕсли;
КонецПроцедуры

Процедура ПодготовитьНастройки(КонтекстПроверки, Заголовки)
		
	КонтекстПроверки.НастройкиКС = Новый Структура;
	
	КонтекстПроверки.НастройкиКС.Вставить("Раздел"				, "");
	КонтекстПроверки.НастройкиКС.Вставить("НомерКС"				, "");
	
	КонтекстПроверки.НастройкиКС.Вставить("Описание"				, "");
	КонтекстПроверки.НастройкиКС.Вставить("Детализация"			, "");
	КонтекстПроверки.НастройкиКС.Вставить("Нарушение"			, "");
	КонтекстПроверки.НастройкиКС.Вставить("Основание"			, "");
	КонтекстПроверки.НастройкиКС.Вставить("Рекомендации"			, "");
	
	КонтекстПроверки.НастройкиКС.Вставить("ДопСведения"			, "");
	КонтекстПроверки.НастройкиКС.Вставить("Комментарий"			, "");
	
	КонтекстПроверки.НастройкиКС.Вставить("ЭтоОшибка"			, Ложь);
	
	КонтекстПроверки.НастройкиКС.Вставить("Условие"				, "");
	КонтекстПроверки.НастройкиКС.Вставить("ДляДокументации"		, "");
	
	КонтекстПроверки.НастройкиКС.Вставить("ШаблонДетализации"	, "");
	КонтекстПроверки.НастройкиКС.Вставить("ШаблонДопСведений"	, "");
	
	Для каждого ЭлементКоллекции Из Заголовки Цикл
		Если КонтекстПроверки.НастройкиКС.Свойство(ЭлементКоллекции.Ключ) Тогда
			КонтекстПроверки.НастройкиКС.Вставить(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);
		КонецЕсли; 
	КонецЦикла;
	
	Приоритет = КонтекстПроверки.ДанныеКС.ПриоритетыРазделов.Найти(КонтекстПроверки.НастройкиКС.Раздел);
	Приоритет = ?(Приоритет = Неопределено, 0, Приоритет + 1);
	
	КонтекстПроверки.НастройкиКС.Вставить("Приоритет"			, Приоритет);
	
	Если КонтекстПроверки.Документирование Тогда
		КонтекстПроверки.ДанныеКС.Счетчик = КонтекстПроверки.ДанныеКС.Счетчик + 1;
		СтрокаОписания = КонтекстПроверки.ТаблицаОписаний.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОписания, КонтекстПроверки.НастройкиКС);
		СтрокаОписания.НомерЭлемента = КонтекстПроверки.ДанныеКС.Счетчик;
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПоказатели(КонтекстПроверки, ИменаПоказателей)
	
	Показатели = Новый Структура;
	
	Для каждого Элемент Из ИменаПоказателей Цикл
		
		Показатели.Вставить(Элемент.Ключ, Новый Структура());
		
		МассивПредставления		= Новый Массив;
		ИмяРаздела				= "";
		ПредставлениеРаздела	= "";
		ПрефиксРаздела			= Сред(Элемент.Ключ, 1, 2);
		
		КонтекстПроверки.ДанныеКС.ИменаРазделов.Свойство(ПрефиксРаздела			, ИмяРаздела);
		КонтекстПроверки.ДанныеКС.ПредставленияРазделов.Свойство(ПрефиксРаздела	, ПредставлениеРаздела);
		
		МассивПредставления.Добавить(КонтекстПроверки.ДанныеКС.ПредставленияПоказателей.Получить(Элемент.Значение));
		МассивПредставления.Добавить(ПредставлениеРаздела);
		
		Представление		= СтрСоединить(МассивПредставления, " ");
		Многострочный		= Ложь;
		Округление			= Ложь;
		
		// постоянные данные
		Показатели[Элемент.Ключ].Вставить("ПрефиксРаздела"	, ПрефиксРаздела);
		Показатели[Элемент.Ключ].Вставить("ИмяПоказателя"	, Элемент.Значение);
		Показатели[Элемент.Ключ].Вставить("Представление"	, Представление);
		Показатели[Элемент.Ключ].Вставить("ИмяРаздела"		, ИмяРаздела);
		
		// переменные данные
		Показатели[Элемент.Ключ].Вставить("Отчет");
		Показатели[Элемент.Ключ].Вставить("НомерСтраницы"	, "");
		Показатели[Элемент.Ключ].Вставить("Значение");
		Показатели[Элемент.Ключ].Вставить("ЗначениеСтр"		, "");
		Показатели[Элемент.Ключ].Вставить("Итог"			, 0);
		
		// сервисные данные
		Показатели[Элемент.Ключ].Вставить("Многострочный"	, Многострочный);
		Показатели[Элемент.Ключ].Вставить("Округление"		, Округление);
		Показатели[Элемент.Ключ].Вставить("Синоним"			, Элемент.Ключ);
		Показатели[Элемент.Ключ].Вставить("Дополнение"		, "");
		Показатели[Элемент.Ключ].Вставить("Заполнять"		, Истина);
		Показатели[Элемент.Ключ].Вставить("Расшифровывать"	, Истина);
		Показатели[Элемент.Ключ].Вставить("Инверсия"		, Ложь);
		
	КонецЦикла;
	
	Возврат Показатели;
	
КонецФункции

Процедура ЗарегистрироватьПроверку(КонтекстПроверки)
	КонтекстПроверки.ДанныеКС.Счетчик = КонтекстПроверки.ДанныеКС.Счетчик + 1;
КонецПроцедуры

Процедура ЗаполнитьИРасшифроватьПоказатели(КонтекстПроверки, Показатели, Источник, НомерСтроки = Неопределено)
	Для каждого Элемент Из Показатели Цикл
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Элемент.Значение, Источник, НомерСтроки);
	КонецЦикла;
КонецПроцедуры

Процедура ДополнитьТаблицуРезультата(КонтекстПроверки)
	
	Если КонтекстПроверки.ДанныеКС.ТолькоОшибки И НЕ КонтекстПроверки.НастройкиКС.ЭтоОшибка Тогда
		УдалитьСтрокиТаблицыРасшифровки(КонтекстПроверки, КонтекстПроверки.ДанныеКС.Счетчик);
		Возврат;
	КонецЕсли;
	
	Если КонтекстПроверки.НастройкиКС.ЭтоОшибка Тогда
		КонтекстПроверки.ДанныеКС.ЧислоОшибок = КонтекстПроверки.ДанныеКС.ЧислоОшибок + 1;
	КонецЕсли;
	
	НоваяСтрока = КонтекстПроверки.ТаблицаРезультата.Добавить();
	
	НоваяСтрока.Раздел 			= КонтекстПроверки.НастройкиКС.Раздел;
	НоваяСтрока.Приоритет		= КонтекстПроверки.НастройкиКС.Приоритет;
	
	НоваяСтрока.НомерЭлемента 	= КонтекстПроверки.ДанныеКС.Счетчик;
	НоваяСтрока.НомерКС 		= КонтекстПроверки.НастройкиКС.НомерКС;
	
	НоваяСтрока.Описание 		= КонтекстПроверки.НастройкиКС.Описание;
	НоваяСтрока.Детализация 	= КонтекстПроверки.НастройкиКС.Детализация;
	НоваяСтрока.Нарушение 		= КонтекстПроверки.НастройкиКС.Нарушение;
	НоваяСтрока.Основание 		= КонтекстПроверки.НастройкиКС.Основание;
	НоваяСтрока.Рекомендации 	= КонтекстПроверки.НастройкиКС.Рекомендации;
	
	НоваяСтрока.ДопСведения 	= КонтекстПроверки.НастройкиКС.ДопСведения;
	НоваяСтрока.Комментарий 	= КонтекстПроверки.НастройкиКС.Комментарий;
	
	НоваяСтрока.ЭтоОшибка 		= КонтекстПроверки.НастройкиКС.ЭтоОшибка;
		
КонецПроцедуры

Процедура УдалитьСтрокиТаблицыРасшифровки(КонтекстПроверки, НомерЭлемента)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("НомерЭлемента", НомерЭлемента);
	
	УдаляемыеСтроки = КонтекстПроверки.ТаблицаРасшифровки.НайтиСтроки(ПараметрыОтбора);
	
	Для каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
		КонтекстПроверки.ТаблицаРасшифровки.Удалить(УдаляемаяСтрока);
	КонецЦикла; 
КонецПроцедуры

Процедура Проверить_2023(КонтекстПроверки)
#Область Проверки_Основные

	ПроверкаКС_1_01(КонтекстПроверки);
	ПроверкаКС_1_02(КонтекстПроверки);
	ПроверкаКС_1_03(КонтекстПроверки);
	ПроверкаКС_1_04(КонтекстПроверки);
	ПроверкаКС_1_05(КонтекстПроверки);
	ПроверкаКС_1_06(КонтекстПроверки);
	ПроверкаКС_1_07(КонтекстПроверки);
	ПроверкаКС_1_08(КонтекстПроверки);
	ПроверкаКС_1_09(КонтекстПроверки);
	ПроверкаКС_1_10(КонтекстПроверки);
	ПроверкаКС_1_11(КонтекстПроверки);
	ПроверкаКС_1_12(КонтекстПроверки);
	ПроверкаКС_1_13(КонтекстПроверки);
	ПроверкаКС_1_14(КонтекстПроверки);
	ПроверкаКС_1_15(КонтекстПроверки);
	ПроверкаКС_1_16(КонтекстПроверки);
	ПроверкаКС_1_17(КонтекстПроверки);
	ПроверкаКС_1_18(КонтекстПроверки);
	ПроверкаКС_1_19(КонтекстПроверки);
	ПроверкаКС_1_20(КонтекстПроверки);
	ПроверкаКС_1_21(КонтекстПроверки);
	ПроверкаКС_1_22(КонтекстПроверки);
	ПроверкаКС_1_23(КонтекстПроверки);
	ПроверкаКС_1_24(КонтекстПроверки);
	ПроверкаКС_1_25(КонтекстПроверки);
	ПроверкаКС_1_26(КонтекстПроверки);
	ПроверкаКС_1_27(КонтекстПроверки);
	ПроверкаКС_1_28(КонтекстПроверки);
	ПроверкаКС_1_29(КонтекстПроверки);
	ПроверкаКС_1_30(КонтекстПроверки);
	ПроверкаКС_1_31(КонтекстПроверки);
	ПроверкаКС_1_32(КонтекстПроверки);
	ПроверкаКС_1_33(КонтекстПроверки);
	ПроверкаКС_1_34(КонтекстПроверки);
	ПроверкаКС_1_35(КонтекстПроверки);
	ПроверкаКС_1_36(КонтекстПроверки);
	ПроверкаКС_1_37(КонтекстПроверки);
	ПроверкаКС_1_38(КонтекстПроверки);
	ПроверкаКС_1_39(КонтекстПроверки);
	ПроверкаКС_1_40(КонтекстПроверки);
	ПроверкаКС_1_41(КонтекстПроверки);
	ПроверкаКС_1_42(КонтекстПроверки);
	ПроверкаКС_1_43(КонтекстПроверки);
	ПроверкаКС_1_44(КонтекстПроверки);
	ПроверкаКС_1_45(КонтекстПроверки);
	ПроверкаКС_1_46(КонтекстПроверки);
	ПроверкаКС_1_47(КонтекстПроверки);
	ПроверкаКС_1_48(КонтекстПроверки);
	ПроверкаКС_1_49(КонтекстПроверки);
	ПроверкаКС_1_50(КонтекстПроверки);
	ПроверкаКС_1_51(КонтекстПроверки);
	ПроверкаКС_1_52(КонтекстПроверки);
	ПроверкаКС_1_53(КонтекстПроверки);
	ПроверкаКС_1_54(КонтекстПроверки);
	ПроверкаКС_1_55(КонтекстПроверки);
	ПроверкаКС_1_56(КонтекстПроверки);
	ПроверкаКС_1_57(КонтекстПроверки);
	ПроверкаКС_1_58(КонтекстПроверки);
	ПроверкаКС_1_59(КонтекстПроверки);
	ПроверкаКС_1_60(КонтекстПроверки);
	ПроверкаКС_1_61(КонтекстПроверки);
	ПроверкаКС_1_62(КонтекстПроверки);
	ПроверкаКС_1_63(КонтекстПроверки);
	ПроверкаКС_1_64(КонтекстПроверки);
	ПроверкаКС_1_65(КонтекстПроверки);
	ПроверкаКС_1_66(КонтекстПроверки);
	ПроверкаКС_1_67(КонтекстПроверки);
	ПроверкаКС_1_68(КонтекстПроверки);
	ПроверкаКС_1_69(КонтекстПроверки);
	ПроверкаКС_1_70(КонтекстПроверки);
	ПроверкаКС_1_71(КонтекстПроверки);
	ПроверкаКС_1_72(КонтекстПроверки);
	ПроверкаКС_1_73(КонтекстПроверки);
	ПроверкаКС_1_74(КонтекстПроверки);
	ПроверкаКС_1_75(КонтекстПроверки);
	ПроверкаКС_1_76(КонтекстПроверки);
	
	#КонецОбласти
	
#Область Проверки_Справочные

	// справочные проверки отключены
	Если КонтекстПроверки.Документирование Тогда
	
		ПроверкаКС_2_01(КонтекстПроверки);
		ПроверкаКС_2_02(КонтекстПроверки);
		ПроверкаКС_2_03(КонтекстПроверки);
		ПроверкаКС_2_04(КонтекстПроверки);
		ПроверкаКС_2_05(КонтекстПроверки);
		ПроверкаКС_2_06(КонтекстПроверки);
		ПроверкаКС_2_07(КонтекстПроверки);
		ПроверкаКС_2_08(КонтекстПроверки);
		ПроверкаКС_2_09(КонтекстПроверки);
		ПроверкаКС_2_10(КонтекстПроверки);
		ПроверкаКС_2_11(КонтекстПроверки);
		ПроверкаКС_2_12(КонтекстПроверки);
		ПроверкаКС_2_13(КонтекстПроверки);
		ПроверкаКС_2_14(КонтекстПроверки);
		ПроверкаКС_2_15(КонтекстПроверки);
		ПроверкаКС_2_16(КонтекстПроверки);
		ПроверкаКС_2_17(КонтекстПроверки);
		ПроверкаКС_2_18(КонтекстПроверки);
		ПроверкаКС_2_19(КонтекстПроверки);
		ПроверкаКС_2_20(КонтекстПроверки);
		ПроверкаКС_2_21(КонтекстПроверки);
		ПроверкаКС_2_22(КонтекстПроверки);
		ПроверкаКС_2_23(КонтекстПроверки);
		ПроверкаКС_2_24(КонтекстПроверки);
		ПроверкаКС_2_25(КонтекстПроверки);
		ПроверкаКС_2_26(КонтекстПроверки);
		ПроверкаКС_2_27(КонтекстПроверки);
		ПроверкаКС_2_28(КонтекстПроверки);
		ПроверкаКС_2_29(КонтекстПроверки);
		ПроверкаКС_2_30(КонтекстПроверки);
		ПроверкаКС_2_31(КонтекстПроверки);
		ПроверкаКС_2_32(КонтекстПроверки);
		ПроверкаКС_2_33(КонтекстПроверки);
		ПроверкаКС_2_34(КонтекстПроверки);
		ПроверкаКС_2_35(КонтекстПроверки);
		ПроверкаКС_2_36(КонтекстПроверки);
		ПроверкаКС_2_37(КонтекстПроверки);
		ПроверкаКС_2_38(КонтекстПроверки);
		ПроверкаКС_2_39(КонтекстПроверки);
		ПроверкаКС_2_40(КонтекстПроверки);
		ПроверкаКС_2_41(КонтекстПроверки);
		ПроверкаКС_2_42(КонтекстПроверки);
		ПроверкаКС_2_43(КонтекстПроверки);
		ПроверкаКС_2_44(КонтекстПроверки);
		ПроверкаКС_2_45(КонтекстПроверки);
		ПроверкаКС_2_46(КонтекстПроверки);
		ПроверкаКС_2_47(КонтекстПроверки);
		ПроверкаКС_2_48(КонтекстПроверки);
		ПроверкаКС_2_49(КонтекстПроверки);
		ПроверкаКС_2_50(КонтекстПроверки);
		ПроверкаКС_2_51(КонтекстПроверки);
		ПроверкаКС_2_52(КонтекстПроверки);
		ПроверкаКС_2_53(КонтекстПроверки);
		ПроверкаКС_2_54(КонтекстПроверки);
		ПроверкаКС_2_55(КонтекстПроверки);
		ПроверкаКС_2_56(КонтекстПроверки);
		ПроверкаКС_2_57(КонтекстПроверки);
		ПроверкаКС_2_58(КонтекстПроверки);
		ПроверкаКС_2_59(КонтекстПроверки);
		ПроверкаКС_2_60(КонтекстПроверки);
		ПроверкаКС_2_61(КонтекстПроверки);
		ПроверкаКС_2_62(КонтекстПроверки);
		ПроверкаКС_2_63(КонтекстПроверки);
		ПроверкаКС_2_64(КонтекстПроверки);
		ПроверкаКС_2_65(КонтекстПроверки);
		ПроверкаКС_2_66(КонтекстПроверки);
		ПроверкаКС_2_67(КонтекстПроверки);
		ПроверкаКС_2_68(КонтекстПроверки);
		ПроверкаКС_2_69(КонтекстПроверки);
		ПроверкаКС_2_70(КонтекстПроверки);
		ПроверкаКС_2_71(КонтекстПроверки);
		ПроверкаКС_2_72(КонтекстПроверки);
		ПроверкаКС_2_73(КонтекстПроверки);
		ПроверкаКС_2_74(КонтекстПроверки);
		ПроверкаКС_2_75(КонтекстПроверки);
	
	КонецЕсли; 
	
#КонецОбласти
КонецПроцедуры

#Область КС_Проверки

#Область КС_Проверки_Основные

Процедура ПроверкаКС_1_01(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.1'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Реализация отложена'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru=''"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru=''"));
	Заголовки.Вставить("Рекомендации"		, "");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 17.03.2023 № ЕА-4-15/3132@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru=''"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_02(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.2'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.УСН_Доходы + НСтр("ru=', то стр.4 <= 251 400 000'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 251 400 000'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочная сумма налога'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните сумму налога в стр.4");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.УСН_Доходы);
	КонтекстПроверки.НастройкиКС.Вставить("ПредельнаяСумма"	, 251400000);
	
	ПроверкаКС_1_02_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_02_код(КонтекстПроверки)
	
	ИменаПоказателей = Новый Структура;
	ИменаПоказателей.Вставить("Р1С01", "КБК");
	ИменаПоказателей.Вставить("Р1С02", "СумНалогАванс");
	
	Показатели = СформироватьПоказатели(КонтекстПроверки, ИменаПоказателей);
	
	Для каждого СтраницаРаздела Из КонтекстПроверки.ДанныеКС.Р1 Цикл
		
		ЗарегистрироватьПроверку(КонтекстПроверки);
		ЗаполнитьИРасшифроватьПоказатели(КонтекстПроверки, Показатели, СтраницаРаздела);
	
		КонтекстПроверки.НастройкиКС.ЭтоОшибка = Показатели.Р1С01.Значение = КонтекстПроверки.НастройкиКС.КБК
			И Показатели.Р1С02.Значение > КонтекстПроверки.НастройкиКС.ПредельнаяСумма;
		КонтекстПроверки.НастройкиКС.ДопСведения = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДопСведений,
			Сред(СтраницаРаздела.НомерСтраницы, 5));
		КонтекстПроверки.НастройкиКС.Детализация = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДетализации, 
			Показатели.Р1С02.Значение);
		ДополнитьТаблицуРезультата(КонтекстПроверки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаКС_1_03(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.3'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.УСН_Доходы + НСтр("ru=', то стр.5 = 34/01, 34/02, 34/03'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 = 34/01, 34/02, 34/03'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.УСН_Доходы);
	КонтекстПроверки.НастройкиКС.Вставить("КодыПериодов"		, "34/01,34/02,34/03");
	
	ПроверкаКС_1_03_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_03_код(КонтекстПроверки)
	
	ИменаПоказателей = Новый Структура;
	ИменаПоказателей.Вставить("Р1С01", "КБК");
	ИменаПоказателей.Вставить("Р1С02", "Период");
	ИменаПоказателей.Вставить("Р1С03", "НомерМесКварт");
	
	Показатели = СформироватьПоказатели(КонтекстПроверки, ИменаПоказателей);
	МассивПериодов = СтрРазделить(КонтекстПроверки.НастройкиКС.КодыПериодов, ",", Ложь);
	
	Для каждого СтраницаРаздела Из КонтекстПроверки.ДанныеКС.Р1 Цикл
		
		ЗарегистрироватьПроверку(КонтекстПроверки);
		ЗаполнитьИРасшифроватьПоказатели(КонтекстПроверки, Показатели, СтраницаРаздела);
	
		КонтекстПроверки.НастройкиКС.ЭтоОшибка = Показатели.Р1С01.Значение = КонтекстПроверки.НастройкиКС.КБК
			И МассивПериодов.Найти(СтраницаРаздела.КодПериода) = Неопределено;
		КонтекстПроверки.НастройкиКС.ДопСведения = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДопСведений,
			Сред(СтраницаРаздела.НомерСтраницы, 5));
		КонтекстПроверки.НастройкиКС.Детализация = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДетализации, 
			СтраницаРаздела.КодПериода);
		ДополнитьТаблицуРезультата(КонтекстПроверки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаКС_1_04(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.4'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Реализация отложена'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru=''"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru=''"));
	Заголовки.Вставить("Рекомендации"		, "");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 17.03.2023 № ЕА-4-15/3132@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru=''"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_05(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.5'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.УСН_Расходы + НСтр("ru=', то стр.4 <= 251 400 000'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 251 400 000'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочная сумма налога'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните сумму налога в стр.4");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.УСН_Расходы);
	КонтекстПроверки.НастройкиКС.Вставить("ПредельнаяСумма"	, 251400000);
	
	ПроверкаКС_1_02_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_06(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.6'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.УСН_Расходы + НСтр("ru=', то стр.5 = 34/01, 34/02, 34/03'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 = 34/01, 34/02, 34/03'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.УСН_Расходы);
	КонтекстПроверки.НастройкиКС.Вставить("КодыПериодов"		, "34/01,34/02,34/03");
	
	ПроверкаКС_1_03_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_07(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.7'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.ЕСХН + НСтр("ru=', то стр.5 = 34/02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 = 34/02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.ЕСХН);
	КонтекстПроверки.НастройкиКС.Вставить("КодыПериодов"		, "34/02");
	
	ПроверкаКС_1_03_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_08(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.8'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 21/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.01'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.01'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0101");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_08_код(КонтекстПроверки)
	
	ИменаПоказателей = Новый Структура;
	ИменаПоказателей.Вставить("Р1С01", "КБК");
	ИменаПоказателей.Вставить("Р1С02", "Период");
	ИменаПоказателей.Вставить("Р1С03", "НомерМесКварт");
	ИменаПоказателей.Вставить("Р0С04", "ДАТА_ПОДПИСИ");
	
	Показатели = СформироватьПоказатели(КонтекстПроверки, ИменаПоказателей);
	
	Для каждого СтраницаРаздела Из КонтекстПроверки.ДанныеКС.Р1 Цикл
		
		ЗарегистрироватьПроверку(КонтекстПроверки);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С01, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С02, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С03, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р0С04, КонтекстПроверки.ДанныеКС.Р0);
	
		КонтекстПроверки.НастройкиКС.ЭтоОшибка = Показатели.Р1С01.Значение = КонтекстПроверки.НастройкиКС.КБК
			И СтраницаРаздела.КодПериода = КонтекстПроверки.НастройкиКС.КодПериода
			И КонтекстПроверки.ДанныеКС.Р0.ДатаПодписи2 < КонтекстПроверки.НастройкиКС.ДатаПодписи;
		КонтекстПроверки.НастройкиКС.ДопСведения = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДопСведений,
			Сред(СтраницаРаздела.НомерСтраницы, 5));
		КонтекстПроверки.НастройкиКС.Детализация = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДетализации, 
			КонтекстПроверки.ДанныеКС.Р0.ДатаПодписи3);
		ДополнитьТаблицуРезультата(КонтекстПроверки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаКС_1_09(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.9'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 21/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0201");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_10(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.10'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 31/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.04'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.04'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0401");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_11(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.11'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 31/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.05'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.05'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0501");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_12(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.12'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 33/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.07'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.07'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0701");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_13(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.13'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 33/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.08'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.08'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0801");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_14(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.14'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 34/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.10'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.10'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1001");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_15(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.15'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 34/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.11'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.11'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1101");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_16(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.16'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 34/03, то '") +
		НСтр("ru='дата представления уведомления >= 01.12'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.12'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1201");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_17(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.17'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 21/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.01'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.01'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0101");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_18(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.18'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 21/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0201");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_19(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.19'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 31/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.04'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.04'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0401");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_20(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.20'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 31/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.05'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.05'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0501");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_21(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.21'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 33/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.07'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.07'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0701");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_22(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.22'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 33/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.08'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.08'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0801");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_23(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.23'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 34/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.10'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.10'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1001");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_24(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.24'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 34/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.11'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.11'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1101");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_25(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.25'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 34/03, то '") +
		НСтр("ru='дата представления уведомления >= 01.12'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.12'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1201");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_26(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.26'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 21/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.01'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.01'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0101");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_27(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.27'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 21/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0201");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_28(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.28'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 31/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.04'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.04'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0401");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_29(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.29'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 31/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.05'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.05'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0501");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_30(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.30'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 33/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.07'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.07'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0701");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_31(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.31'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 33/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.08'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.08'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0801");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_32(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.32'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 34/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.10'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.10'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1001");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_33(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.33'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 34/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.11'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.11'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1101");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_34(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.34'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 34/03, то '") +
		НСтр("ru='дата представления уведомления >= 01.12'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.12'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1201");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_35(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.35'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 21/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.01'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.01'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0101");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_36(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.36'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 21/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0201");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_37(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.37'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 31/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.04'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.04'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0401");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_38(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.38'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 31/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.05'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.05'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0501");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_39(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.39'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 33/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.07'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.07'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0701");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_40(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.40'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 33/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.08'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.08'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0801");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_41(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.41'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 34/01, то '") +
		НСтр("ru='дата представления уведомления >= 01.10'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.10'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1001");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_42(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.42'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 34/02, то '") +
		НСтр("ru='дата представления уведомления >= 01.11'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.11'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1101");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_43(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.43'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 34/03, то '") +
		НСтр("ru='дата представления уведомления >= 01.12'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.12'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1201");
	
	ПроверкаКС_1_08_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_44(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.44'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', то стр.6 >= 2023'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 2023'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный отчетный год'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните отчетный год в стр.6");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("Год"				, "2023");
	
	ПроверкаКС_1_44_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_44_код(КонтекстПроверки)
	
	ИменаПоказателей = Новый Структура;
	ИменаПоказателей.Вставить("Р1С01", "КБК");
	ИменаПоказателей.Вставить("Р1С02", "Год");
	
	Показатели = СформироватьПоказатели(КонтекстПроверки, ИменаПоказателей);
	
	Для каждого СтраницаРаздела Из КонтекстПроверки.ДанныеКС.Р1 Цикл
		
		ЗарегистрироватьПроверку(КонтекстПроверки);
		ЗаполнитьИРасшифроватьПоказатели(КонтекстПроверки, Показатели, СтраницаРаздела);
	
		КонтекстПроверки.НастройкиКС.ЭтоОшибка = НЕ КонтекстПроверки.НастройкиКС.КБК.Найти(Показатели.Р1С01.Значение) = Неопределено
			И Показатели.Р1С02.Значение < КонтекстПроверки.НастройкиКС.Год;
		КонтекстПроверки.НастройкиКС.ДопСведения = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДопСведений,
			Сред(СтраницаРаздела.НомерСтраницы, 5));
		КонтекстПроверки.НастройкиКС.Детализация = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДетализации, 
			Показатели.Р1С02.ЗначениеСтр);
		ДополнитьТаблицуРезультата(КонтекстПроверки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаКС_1_45(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.45'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 21/01, то дата представления уведомления >= 01.01'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.01'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0101");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_45_код(КонтекстПроверки)
	
	ИменаПоказателей = Новый Структура;
	ИменаПоказателей.Вставить("Р1С01", "КБК");
	ИменаПоказателей.Вставить("Р1С02", "Период");
	ИменаПоказателей.Вставить("Р1С03", "НомерМесКварт");
	ИменаПоказателей.Вставить("Р0С04", "ДАТА_ПОДПИСИ");
	
	Показатели = СформироватьПоказатели(КонтекстПроверки, ИменаПоказателей);
	
	Для каждого СтраницаРаздела Из КонтекстПроверки.ДанныеКС.Р1 Цикл
		
		ЗарегистрироватьПроверку(КонтекстПроверки);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С01, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С02, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С03, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р0С04, КонтекстПроверки.ДанныеКС.Р0);
	
		КонтекстПроверки.НастройкиКС.ЭтоОшибка = НЕ КонтекстПроверки.НастройкиКС.КБК.Найти(Показатели.Р1С01.Значение) = Неопределено
			И СтраницаРаздела.КодПериода = КонтекстПроверки.НастройкиКС.КодПериода
			И КонтекстПроверки.ДанныеКС.Р0.ДатаПодписи2 < КонтекстПроверки.НастройкиКС.ДатаПодписи;
		КонтекстПроверки.НастройкиКС.ДопСведения = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДопСведений,
			Сред(СтраницаРаздела.НомерСтраницы, 5));
		КонтекстПроверки.НастройкиКС.Детализация = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДетализации, 
			КонтекстПроверки.ДанныеКС.Р0.ДатаПодписи3);
		ДополнитьТаблицуРезультата(КонтекстПроверки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаКС_1_46(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.46'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 21/02, то дата представления уведомления >= 01.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0201");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_47(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.47'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 21/03, то дата представления уведомления >= 01.03'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.03'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0301");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_48(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.48'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 31/01, то дата представления уведомления >= 01.04'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.04'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0401");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_49(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.49'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 31/02, то дата представления уведомления >= 01.05'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.05'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0501");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_50(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.50'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 31/03, то дата представления уведомления >= 01.06'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.06'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0601");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_51(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.51'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 33/01, то дата представления уведомления >= 01.07'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.07'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0701");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_52(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.52'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 33/02, то дата представления уведомления >= 01.08'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.08'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0801");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_53(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.53'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 33/03, то дата представления уведомления >= 01.09'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.09'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0901");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_54(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.54'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/01, то дата представления уведомления >= 01.10'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.10'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1001");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_55(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.55'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/02, то дата представления уведомления >= 01.11'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.11'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1101");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_56(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.56'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/03, то дата представления уведомления >= 01.12'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.12'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1201");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_57(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.57'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/04, то дата представления уведомления >= 23.12'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 23.12'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/04");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1223");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_58(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.58'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', то стр.6 >= 2023'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 2023'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный отчетный год'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните отчетный год в стр.6");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("Год"				, "2023");
	
	ПроверкаКС_1_44_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_59(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.59'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 21/01, то дата представления уведомления >= 01.01'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.01'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0101");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_60(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.60'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 21/02, то дата представления уведомления >= 01.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0201");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_61(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.61'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 31/01, то дата представления уведомления >= 01.04'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.04'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0401");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_62(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.62'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 31/02, то дата представления уведомления >= 01.05'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.05'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0501");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_63(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.63'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 33/01, то дата представления уведомления >= 01.07'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.07'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0701");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_64(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.64'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 33/02, то дата представления уведомления >= 01.08'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.08'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0801");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_65(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.65'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/01, то дата представления уведомления >= 01.10'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.10'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1001");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_66(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.66'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/02, то дата представления уведомления >= 01.11'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.11'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1101");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_67(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.67'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/03, то дата представления уведомления >= 01.01'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.01'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный код периода или номер месяца'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните код периода или номер месяца в стр.5");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0101");
	
	ПроверкаКС_1_45_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_68(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.68'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_УСН_1, ", ") + 
		НСтр("ru=', стр.5 = 34/01, то дата представления уведомления >= 01.01 отчетного года, указанного в стр.6'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.01, %2 = %3'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный номер месяца или номер года'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните номер месяца или номер года в стр.5, 6");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_УСН_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0101");
	
	ПроверкаКС_1_68_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_68_код(КонтекстПроверки)
	
	ИменаПоказателей = Новый Структура;
	ИменаПоказателей.Вставить("Р1С01", "КБК");
	ИменаПоказателей.Вставить("Р1С02", "Период");
	ИменаПоказателей.Вставить("Р1С03", "НомерМесКварт");
	ИменаПоказателей.Вставить("Р1С04", "Год");
	ИменаПоказателей.Вставить("Р0С05", "ДАТА_ПОДПИСИ");
	
	Показатели = СформироватьПоказатели(КонтекстПроверки, ИменаПоказателей);
	
	Для каждого СтраницаРаздела Из КонтекстПроверки.ДанныеКС.Р1 Цикл
		
		ЗарегистрироватьПроверку(КонтекстПроверки);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С01, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С02, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С03, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С04, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р0С05, КонтекстПроверки.ДанныеКС.Р0);
	
		КонтекстПроверки.НастройкиКС.ЭтоОшибка = НЕ КонтекстПроверки.НастройкиКС.КБК.Найти(Показатели.Р1С01.Значение) = Неопределено
			И СтраницаРаздела.КодПериода = КонтекстПроверки.НастройкиКС.КодПериода
			И НЕ (КонтекстПроверки.ДанныеКС.Р0.ДатаПодписи2 >= КонтекстПроверки.НастройкиКС.ДатаПодписи И Показатели.Р1С04.Значение = КонтекстПроверки.ДанныеКС.Р0.ГодПодписи);
		КонтекстПроверки.НастройкиКС.ДопСведения = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДопСведений,
			Сред(СтраницаРаздела.НомерСтраницы, 5));
		КонтекстПроверки.НастройкиКС.Детализация = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДетализации, 
			КонтекстПроверки.ДанныеКС.Р0.ДатаПодписи3, КонтекстПроверки.ДанныеКС.Р0.ГодПодписи, Показатели.Р1С04.ЗначениеСтр);
		ДополнитьТаблицуРезультата(КонтекстПроверки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаКС_1_69(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.69'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_УСН_1, ", ") + 
		НСтр("ru=', стр.5 = 34/02, то дата представления уведомления >= 01.04 отчетного года, указанного в стр.6'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.04, %2 = %3'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный номер месяца или номер года'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните номер месяца или номер года в стр.5, 6");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_УСН_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0401");
	
	ПроверкаКС_1_68_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_70(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.70'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_УСН_1, ", ") + 
		НСтр("ru=', стр.5 = 34/03, то дата представления уведомления >= 01.07 отчетного года, указанного в стр.6'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 >= 01.07, %2 = %3'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Ошибочный номер месяца или номер года'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните номер месяца или номер года в стр.5, 6");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_УСН_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0701");
	
	ПроверкаКС_1_68_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_71(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.71'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Реализация отложена'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru=''"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru=''"));
	Заголовки.Вставить("Рекомендации"		, "");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 17.03.2023 № ЕА-4-15/3132@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru=''"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_72(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.72'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Реализация отложена'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru=''"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru=''"));
	Заголовки.Вставить("Рекомендации"		, "");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 17.03.2023 № ЕА-4-15/3132@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru=''"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_73(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.73'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Реализация отложена'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru=''"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru=''"));
	Заголовки.Вставить("Рекомендации"		, "");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 17.03.2023 № ЕА-4-15/3132@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru=''"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_74(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.74'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Реализация отложена'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru=''"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru=''"));
	Заголовки.Вставить("Рекомендации"		, "");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 17.03.2023 № ЕА-4-15/3132@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru=''"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_75(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.75'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Реализация отложена'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru=''"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru=''"));
	Заголовки.Вставить("Рекомендации"		, "");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 17.03.2023 № ЕА-4-15/3132@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru=''"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
КонецПроцедуры

Процедура ПроверкаКС_1_76(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='1.76'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Реализация отложена'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru=''"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru=''"));
	Заголовки.Вставить("Рекомендации"		, "");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 17.03.2023 № ЕА-4-15/3132@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru=''"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
КонецПроцедуры

#КонецОбласти

#Область КС_Проверки_Справочные

Процедура ПроверкаКС_2_01(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.1'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 21/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0225");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_01_код(КонтекстПроверки)
	
	ИменаПоказателей = Новый Структура;
	ИменаПоказателей.Вставить("Р1С01", "КБК");
	ИменаПоказателей.Вставить("Р1С02", "Период");
	ИменаПоказателей.Вставить("Р1С03", "НомерМесКварт");
	ИменаПоказателей.Вставить("Р0С04", "ДАТА_ПОДПИСИ");
	
	Показатели = СформироватьПоказатели(КонтекстПроверки, ИменаПоказателей);
	
	Для каждого СтраницаРаздела Из КонтекстПроверки.ДанныеКС.Р1 Цикл
		
		ЗарегистрироватьПроверку(КонтекстПроверки);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С01, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С02, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С03, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р0С04, КонтекстПроверки.ДанныеКС.Р0);
	
		КонтекстПроверки.НастройкиКС.ЭтоОшибка = Показатели.Р1С01.Значение = КонтекстПроверки.НастройкиКС.КБК
			И СтраницаРаздела.КодПериода = КонтекстПроверки.НастройкиКС.КодПериода
			И КонтекстПроверки.ДанныеКС.Р0.ДатаПодписи2 > КонтекстПроверки.НастройкиКС.ДатаПодписи;
		КонтекстПроверки.НастройкиКС.ДопСведения = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДопСведений,
			Сред(СтраницаРаздела.НомерСтраницы, 5));
		КонтекстПроверки.НастройкиКС.Детализация = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДетализации, 
			КонтекстПроверки.ДанныеКС.Р0.ДатаПодписи3);
		ДополнитьТаблицуРезультата(КонтекстПроверки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаКС_2_02(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.2'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 21/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.03'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.03'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0325");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_03(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.3'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 31/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.05'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.05'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0525");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_04(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.4'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 31/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.06'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.06'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0625");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_05(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.5'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 33/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.08'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.08'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0825");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_06(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.6'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 33/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.09'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.09'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0925");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_07(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.7'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 34/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.11'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.11'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1125");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_08(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.8'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 34/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.12'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.12'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1225");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_09(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.9'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин + НСтр("ru=', стр.5 = 34/03, то '") +
		НСтр("ru='дата представления уведомления <= 25.01'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.01'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Ин);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0125");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_10(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.10'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 21/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0225");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_11(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.11'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 21/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.03'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.03'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0325");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_12(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.12'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 31/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.05'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.05'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0525");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_13(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.13'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 31/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.06'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.06'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0625");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_14(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.14'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 33/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.08'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.08'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0825");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_15(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.15'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 33/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.09'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.09'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0925");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_16(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.16'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 34/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.11'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.11'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1125");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_17(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.17'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 34/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.12'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.12'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1225");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_18(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.18'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн + НСтр("ru=', стр.5 = 34/03, то '") +
		НСтр("ru='дата представления уведомления <= 25.01'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.01'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосИн);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0125");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_19(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.19'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 21/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0225");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_20(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.20'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 21/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.03'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.03'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0325");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_21(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.21'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 31/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.05'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.05'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0525");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_22(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.22'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 31/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.06'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.06'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0625");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_23(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.23'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 33/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.08'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.08'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0825");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_24(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.24'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 33/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.09'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.09'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0925");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_25(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.25'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 34/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.11'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.11'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1125");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_26(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.26'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 34/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.12'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.12'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1225");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_27(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.27'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос + НСтр("ru=', стр.5 = 34/03, то '") +
		НСтр("ru='дата представления уведомления <= 25.01'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.01'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Див_РосРос);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0125");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_28(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.28'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 21/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0225");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_29(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.29'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 21/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.03'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.03'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0325");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_30(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.30'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 31/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.05'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.05'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0525");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_31(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.31'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 31/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.06'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.06'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0625");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_32(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.32'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 33/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.08'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.08'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0825");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_33(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.33'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 33/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.09'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.09'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0925");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_34(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.34'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 34/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.11'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.11'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1125");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_35(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.35'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 34/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.12'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.12'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1225");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_36(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.36'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц + НСтр("ru=', стр.5 = 34/03, то '") +
		НСтр("ru='дата представления уведомления <= 25.01'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.01'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Прибыль_Проц);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0125");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_37(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.37'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Реализация отложена'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru=''"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru=''"));
	Заголовки.Вставить("Рекомендации"		, "");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 17.03.2023 № ЕА-4-15/3132@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru=''"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_38(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.38'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_2, ", ") + 
		НСтр("ru=', стр.5 = 21/01, то дата представления уведомления <= 25.01'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.01'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_2);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0125");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_38_код(КонтекстПроверки)
	
	ИменаПоказателей = Новый Структура;
	ИменаПоказателей.Вставить("Р1С01", "КБК");
	ИменаПоказателей.Вставить("Р1С02", "Период");
	ИменаПоказателей.Вставить("Р1С03", "НомерМесКварт");
	ИменаПоказателей.Вставить("Р0С04", "ДАТА_ПОДПИСИ");
	
	Показатели = СформироватьПоказатели(КонтекстПроверки, ИменаПоказателей);
	
	Для каждого СтраницаРаздела Из КонтекстПроверки.ДанныеКС.Р1 Цикл
		
		ЗарегистрироватьПроверку(КонтекстПроверки);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С01, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С02, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р1С03, СтраницаРаздела);
		ЗаполнитьИРасшифроватьПоказатель(КонтекстПроверки, Показатели.Р0С04, КонтекстПроверки.ДанныеКС.Р0);
	
		КонтекстПроверки.НастройкиКС.ЭтоОшибка = НЕ КонтекстПроверки.НастройкиКС.КБК.Найти(Показатели.Р1С01.Значение) = Неопределено
			И СтраницаРаздела.КодПериода = КонтекстПроверки.НастройкиКС.КодПериода
			И КонтекстПроверки.ДанныеКС.Р0.ДатаПодписи2 > КонтекстПроверки.НастройкиКС.ДатаПодписи;
		КонтекстПроверки.НастройкиКС.ДопСведения = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДопСведений,
			Сред(СтраницаРаздела.НомерСтраницы, 5));
		КонтекстПроверки.НастройкиКС.Детализация = СтрШаблон(КонтекстПроверки.НастройкиКС.ШаблонДетализации, 
			КонтекстПроверки.ДанныеКС.Р0.ДатаПодписи3);
		ДополнитьТаблицуРезультата(КонтекстПроверки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаКС_2_39(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.39'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 21/02, то дата представления уведомления <= 25.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0225");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_40(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.40'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 21/03, то дата представления уведомления <= 25.03'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.03'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0325");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_41(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.41'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 31/01, то дата представления уведомления <= 25.04'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.04'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0425");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_42(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.42'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 31/02, то дата представления уведомления <= 25.05'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.05'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0525");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_43(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.43'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 31/03, то дата представления уведомления <= 25.06'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.06'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0625");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_44(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.44'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 33/01, то дата представления уведомления <= 25.07'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.07'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0725");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_45(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.45'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 33/02, то дата представления уведомления <= 25.08'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.08'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0825");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_46(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.46'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 33/03, то дата представления уведомления <= 25.09'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.09'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0925");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_47(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.47'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/01, то дата представления уведомления <= 25.10'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.10'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1025");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_48(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.48'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/02, то дата представления уведомления <= 25.11'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.11'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1125");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_49(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.49'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/03, то дата представления уведомления <= 25.12'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.12'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1225");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_50(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.50'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/04, то дата представления уведомления <= 25.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_НДФЛ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/04");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0225");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_51(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.51'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Реализация отложена'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru=''"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru=''"));
	Заголовки.Вставить("Рекомендации"		, "");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 17.03.2023 № ЕА-4-15/3132@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru=''"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_52(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.52'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 21/01, то дата представления уведомления <= 25.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0225");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_53(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.53'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 21/02, то дата представления уведомления <= 25.03'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.03'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "21/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0325");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_54(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.54'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 31/01, то дата представления уведомления <= 25.05'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.05'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0525");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_55(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.55'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 31/02, то дата представления уведомления <= 25.06'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.06'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "31/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0625");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_56(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.56'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 33/01, то дата представления уведомления <= 25.08'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.08'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0825");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_57(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.57'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 33/02, то дата представления уведомления <= 25.09'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.09'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "33/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0925");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_58(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.58'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/01, то дата представления уведомления <= 25.11'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.11'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1125");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_59(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.59'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/02, то дата представления уведомления <= 25.12'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.12'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1225");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_60(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.60'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1, ", ") + 
		НСтр("ru=', стр.5 = 34/03, то дата представления уведомления <= 25.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_РСВ_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0225");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_61(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.61'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Имущество, ", ") + 
		НСтр("ru=', стр.5 = 34/01, то дата представления уведомления <= 25.04'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.04'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Имущество);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0425");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_62(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.62'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Имущество, ", ") + 
		НСтр("ru=', стр.5 = 34/02, то дата представления уведомления <= 25.07'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.07'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Имущество);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0725");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_63(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.63'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Имущество, ", ") + 
		НСтр("ru=', стр.5 = 34/03, то дата представления уведомления <= 25.10'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.10'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Имущество);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1025");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_64(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.64'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Имущество, ", ") + 
		НСтр("ru=', стр.5 = 34/04, то дата представления уведомления <= 25.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Имущество);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/04");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0225");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_65(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.65'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Транспортный + НСтр("ru=', стр.5 = 34/01, то '") +
		НСтр("ru='дата представления уведомления <= 25.04'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.04'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Транспортный);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0425");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_66(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.66'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Транспортный + НСтр("ru=', стр.5 = 34/02, то '") +
		НСтр("ru='дата представления уведомления <= 25.07'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.07'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Транспортный);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0725");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_67(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.67'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Транспортный + НСтр("ru=', стр.5 = 34/03, то '") +
		НСтр("ru='дата представления уведомления <= 25.10'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.10'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Транспортный);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1025");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_68(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.68'"));
	Заголовки.Вставить("Описание"			, 
		НСтр("ru='Если КБК в стр.3 = '") + КонтекстПроверки.ДанныеКС.КБК.Транспортный + НСтр("ru=', стр.5 = 34/04, то '") +
		НСтр("ru='дата представления уведомления <= 25.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КБК.Транспортный);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/04");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0225");
	
	ПроверкаКС_2_01_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_69(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.69'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Земля, ", ") + 
		НСтр("ru=', стр.5 = 34/01, то дата представления уведомления <= 25.04'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.04'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Земля);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0425");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_70(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.70'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Земля, ", ") + 
		НСтр("ru=', стр.5 = 34/02, то дата представления уведомления <= 25.07'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.07'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Земля);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0725");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_71(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.71'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Земля, ", ") + 
		НСтр("ru=', стр.5 = 34/03, то дата представления уведомления <= 25.10'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.10'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Земля);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1025");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_72(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.72'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Земля, ", ") + 
		НСтр("ru=', стр.5 = 34/04, то дата представления уведомления <= 25.02'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.02'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_Земля);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/04");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0225");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_73(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.73'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_УСН_1, ", ") + 
		НСтр("ru=', стр.5 = 34/01, то дата представления уведомления <= 25.04'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.04'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_УСН_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/01");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0425");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_74(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.74'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_УСН_1, ", ") + 
		НСтр("ru=', стр.5 = 34/02, то дата представления уведомления <= 25.07'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.07'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_УСН_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/02");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "0725");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

Процедура ПроверкаКС_2_75(КонтекстПроверки)
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("Раздел"				, НСтр("ru='Сведения о суммах налогов'"));
	Заголовки.Вставить("НомерКС"			, НСтр("ru='2.75'"));
	Заголовки.Вставить("Описание"			, НСтр("ru='Если КБК в стр.3 = '") + 
		СтрСоединить(КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_УСН_1, ", ") + 
		НСтр("ru=', стр.5 = 34/03, то дата представления уведомления <= 25.10'"));
	Заголовки.Вставить("ШаблонДетализации"	, НСтр("ru='%1 <= 25.10'"));
	Заголовки.Вставить("Нарушение"			, НСтр("ru='Возможно указана ошибочная дата подписи отчета'"));
	Заголовки.Вставить("Рекомендации"		, "Уточните дату подписи на Титульном листе");
	Заголовки.Вставить("Основание"			, НСтр("ru='Письмо ФНС России от 21.02.2023 № ЕА-4-15/2048@'"));
	Заголовки.Вставить("ШаблонДопСведений"	, НСтр("ru='Страница %1; Проверка носит справочный характер'"));
	ПодготовитьНастройки(КонтекстПроверки, Заголовки);
	
	Если КонтекстПроверки.Документирование Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПроверки.НастройкиКС.Вставить("КБК"				, КонтекстПроверки.ДанныеКС.КомплектыКБК.Комплект_УСН_1);
	КонтекстПроверки.НастройкиКС.Вставить("КодПериода"		, "34/03");
	КонтекстПроверки.НастройкиКС.Вставить("ДатаПодписи"		, "1025");
	
	ПроверкаКС_2_38_код(КонтекстПроверки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти