#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВходящийДокументСЭДОФСС") Тогда
		
		// Определяем тип сообщения ответа.
		СоответствиеТипов = Новый Соответствие;
		СоответствиеТипов.Вставить(303, 313);
		СоответствиеТипов.Вставить(308, 314);
		ТипЗапроса = Число(ДанныеЗаполнения.ТипСообщения);
		ТипСообщенияОтвета = СоответствиеТипов[ТипЗапроса];
		Если НЕ ЗначениеЗаполнено(ТипСообщенияОтвета) Тогда
			Шаблон = НСтр("'Не удалось определить тип ответа на требование с типом %1'");
			ОписаниеОшибки = СтрШаблон(Шаблон, ТипЗапроса);
			ВызватьИсключение(ОписаниеОшибки);
		КонецЕсли;
		
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПредоставленныеДокументы.НаборДокументов КАК НаборДокументов
		|ИЗ
		|	Документ.ОтветСтрахователяНаТребованиеПроверкиФСС.ПредоставленныеДокументы КАК ПредоставленныеДокументы
		|ГДЕ
		|	ПредоставленныеДокументы.Ссылка.Основание = &Основание
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаборДокументов УБЫВ";
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Основание", ДанныеЗаполнения.Ссылка);
		Выборка = Запрос.Выполнить();
		
		Если НЕ Выборка.Пустой() Тогда
			ИдентификаторНабораДокументов = Выборка.Выгрузить()[0].НаборДокументов + 1;
		Иначе
			ИдентификаторНабораДокументов = 1;
		КонецЕсли;
		
		Основание = ДанныеЗаполнения.Ссылка;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Организация = ДанныеЗаполнения.Организация;
		
		Для Каждого ТекСтрокаЗапрашиваемыеДокументы Из ДанныеЗаполнения.ЗапрашиваемыеДокументы Цикл
			НоваяСтрока = ПредоставленныеДокументы.Добавить();
			НоваяСтрока.ДатаДокумента = ТекущаяДатаСеанса();
			НоваяСтрока.НаборДокументов = ИдентификаторНабораДокументов;
			НоваяСтрока.ВидДокумента = ТекСтрокаЗапрашиваемыеДокументы.ВидДокумента;
			НоваяСтрока.КоличествоДокументовВоВложении = ТекСтрокаЗапрашиваемыеДокументы.КоличествоДокументов;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
