#Область ПрограммныйИнтерфейс

// См. ОбщегоНазначенияКлиентПереопределяемый.ПриУстановкеЗаголовкаКлиентскогоПриложения.
Процедура ПриУстановкеЗаголовкаКлиентскогоПриложения(ЗаголовокПриложения, ПриЗапуске) Экспорт
	
	ПараметрыРаботыКлиентаПриЗапуске = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	Если Не ПараметрыРаботыКлиентаПриЗапуске.Свойство("ЗаголовокПриложенияВалютыУНФ") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаголовокСВалютами = ПараметрыРаботыКлиентаПриЗапуске.ЗаголовокПриложенияВалютыУНФ;
	КомпонентыЗаголовка = Новый Массив;
	КомпонентыЗаголовка.Добавить(ЗаголовокПриложения);
	КомпонентыЗаголовка.Добавить(" / ");
	КомпонентыЗаголовка.Добавить(ЗаголовокСВалютами);
	ЗаголовокПриложения = СтрСоединить(КомпонентыЗаголовка);
	
КонецПроцедуры

#КонецОбласти