#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СерияПриИзменении(Элемент)
	
	СформироватьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	
	СформироватьНаименование();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	
	Наименование = СтрШаблон("%1 серия №%2 по %3",
		СокрЛП(Объект.Серия),
		СокрЛП(Объект.Номер),
		СокрЛП(Формат(Объект.СрокДействия, "ДФ=dd.MM.yy")));
	
	Объект.Наименование = Наименование;
КонецПроцедуры

#КонецОбласти
