////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетЛичныйКабинетВнутренний
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ОсновнаяОрганизация() Экспорт
	
	Возврат ЕдиныйНалоговыйСчетЛичныйКабинет.ОсновнаяОрганизация();
	
КонецФункции

Функция ОсновнаяРегистрацияВНалоговомОргане(Организация) Экспорт
	
	Возврат ЕдиныйНалоговыйСчетЛичныйКабинет.ОсновнаяРегистрацияВНалоговомОргане(Организация);
	
КонецФункции

Функция ПодготовитьДанные(Параметры) Экспорт
	
	Возврат ЕдиныйНалоговыйСчетЛичныйКабинет.ПодготовитьДанные(Параметры);
	
КонецФункции

Функция ДанныеБлижайшегоПлатежа(Параметры) Экспорт
	
	Возврат ЕдиныйНалоговыйСчетЛичныйКабинет.ДанныеБлижайшегоПлатежа(Параметры);
	
КонецФункции

Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	ЕдиныйНалоговыйСчетЛичныйКабинет.ПриСозданииНаСервере(Форма);
	
КонецПроцедуры

Процедура ПодготовитьФормуНаСервере(Форма) Экспорт
	
	ЕдиныйНалоговыйСчетЛичныйКабинет.ПодготовитьФормуНаСервере(Форма);
	
КонецПроцедуры

Процедура УстановитьПараметрыСписков(Форма) Экспорт
	
	ЕдиныйНалоговыйСчетЛичныйКабинет.УстановитьПараметрыСписков(Форма);
	
КонецПроцедуры

Процедура УправлениеФормой(Форма) Экспорт
	
	ЕдиныйНалоговыйСчетЛичныйКабинет.УправлениеФормой(Форма);
	
КонецПроцедуры

Процедура ПереключениеКомандПлатежиРасхождение(Форма) Экспорт
	
	ЕдиныйНалоговыйСчетЛичныйКабинет.ПереключениеКомандПлатежиРасхождение(Форма);
	
КонецПроцедуры

Процедура ПереключениеКомандОтчетыРасхождение(Форма) Экспорт
	
	ЕдиныйНалоговыйСчетЛичныйКабинет.ПереключениеКомандОтчетыРасхождение(Форма);
	
КонецПроцедуры

Процедура ПереключениеКомандНепроведенныеПлатежиРасхождение(Форма) Экспорт
	
	ЕдиныйНалоговыйСчетЛичныйКабинет.ПереключениеКомандНепроведенныеПлатежиРасхождение(Форма);
	
КонецПроцедуры

#КонецОбласти
