
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗаказПокупателяFBSOZONПоЗаказуПокупателя(ЗаказПокупателя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	mega_ЗаказПокупателя_FBS_OZON.Ссылка
		|ИЗ
		|	Документ.mega_ЗаказПокупателя_FBS_OZON КАК mega_ЗаказПокупателя_FBS_OZON
		|ГДЕ
		|	mega_ЗаказПокупателя_FBS_OZON.ЗаказПокупателя = &ЗаказПокупателя
		|	И НЕ mega_ЗаказПокупателя_FBS_OZON.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Возврат ПустаяСсылка();
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область ИнтерфейсПечати


Функция СформироватьПечатнуюФормуСтикера(ДанныеПачати)Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.mega_ЗаказПокупателя_FBS_OZON.ПФ_MXL_Стикер");
	ОбластьМакета = Макет.ПолучитьОбласть("Строка|Столбец");
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	//ПараметрыШтрихкода = Новый Структура;
	//ПараметрыШтрихкода.Вставить("Ширина",           Окр(ОбластьМакета.Рисунки.Заказ.Ширина / КоличествоМиллиметровВПикселе));
	//ПараметрыШтрихкода.Вставить("Высота",           Окр(ОбластьМакета.Рисунки.Заказ.Высота / КоличествоМиллиметровВПикселе));
	//ПараметрыШтрихкода.Вставить("Штрихкод",         СокрЛП(ДанныеПачати.НомерВходящегоДокумента));
	//ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0); // Штрихкод - это строка
	//ПараметрыШтрихкода.Вставить("ТипКода",          3); // Code39
	//ПараметрыШтрихкода.Вставить("ОтображатьТекст",  Ложь);
	//ПараметрыШтрихкода.Вставить("РазмерШрифта",     6);
	//
	//ОбластьМакета.Рисунки.Заказ.Картинка 	= МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
	ОбластьМакета.Параметры.НомерВходящегоДокумента 	= СокрЛП(ДанныеПачати.НомерВходящегоДокумента);
	ОбластьМакета.Параметры.Артикул 				= СокрЛП(ДанныеПачати.Номенклатура.Артикул);
	ОбластьМакета.Параметры.Наименование 			= СокрЛП(ДанныеПачати.Номенклатура.НаименованиеПолное);
	ОбластьМакета.Параметры.ДатаВремя				= ТекущаяДатаСеанса();
	ОбластьМакета.Параметры.Компьютер				= ИмяКомпьютера();
	ОбластьМакета.Параметры.Пользователь			= Строка(Пользователи.ТекущийПользователь());
	
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",           Окр(ОбластьМакета.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",           Окр(ОбластьМакета.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод",         СокрЛП(ДанныеПачати.Номенклатура.Идентификатор));
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0); // Штрихкод - это строка
	ПараметрыШтрихкода.Вставить("ТипКода",          1); // EAN13
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",  Истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",     6);
	
	ОбластьМакета.Рисунки.Штрихкод.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	Возврат ТабличныйДокумент
	
КонецФункции

Процедура СформироватьПечатнуюФормуСтикеры(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	
	ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
	ПервыйДокумент = Истина;
	
	Для Каждого ЗаказПокупателя Из МассивОбъектов Цикл 
		Для Каждого Стикер Из ЗаказПокупателя.Запасы Цикл 
			
			
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент    = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			
			ДанныеПачати = Новый Структура("Номенклатура,НомерВходящегоДокумента");
			ЗаполнитьЗначенияСвойств(ДанныеПачати, Стикер);
			ТабличныйДокумент.Вывести(СформироватьПечатнуюФормуСтикера(ДанныеПачати));
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Стикер);		
		КонецЦикла;
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

Функция СформироватьПечатнуюФормуСтикераПоДаннымОзон(Штрихкод, СКЮ, Наименование)Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.mega_ЗаказПокупателя_FBS_OZON.ПФ_MXL_СтикерПоДаннымОзон");
	ОбластьМакета = Макет.ПолучитьОбласть("Строка|Столбец");
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Вставить("Ширина",           Окр(ОбластьМакета.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",           Окр(ОбластьМакета.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод",         Штрихкод);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0); // Штрихкод - это строка
	ПараметрыШтрихкода.Вставить("ТипКода",          16); // EAN13
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",  Истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",     6);  
	
	Результат = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	ОбластьМакета.Рисунки.Штрихкод.Картинка = Результат.Картинка;
	ОбластьМакета.Параметры.Наименование = Наименование;
	
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	Возврат ТабличныйДокумент
	
КонецФункции

Процедура СформироватьПечатнуюФормуСтикерыЛокализация(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	
	ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
	ПервыйДокумент = Истина;
	
	Для Каждого ЗаказПокупателя Из МассивОбъектов Цикл 
		Для Каждого Стикер Из ЗаказПокупателя.Запасы Цикл 
			
			Штрихкоды = Справочники.mega_ЛичныеКабинеты_OZON.ПолучитьШтрикодыЗаказа(
				Стикер.НомерВходящегоДокумента, ЗаказПокупателя.ЛичныйКабинет);
			//Штрихкоды = Обработки.mega_ПечатьСтикеровAPIOzon.Создать().ПолучитьШтрикодыЗаказа(Стикер.НомерВходящегоДокумента);
			//Штрихкоды = СформироватьПечатнуюФормуСтикеровПоДаннымОзон(ШтрихкодыЗаказа);
			Для Каждого Штрихкод Из Штрихкоды Цикл
				
				
				Если Не ПервыйДокумент Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				ПервыйДокумент    = Ложь;
				НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				
				ТабличныйДокумент.Вывести(СформироватьПечатнуюФормуСтикераПоДаннымОзон(
					Штрихкод["barcode"], Формат(Штрихкод["sku"], "ЧЦ=15; ЧДЦ=0; ЧРГ=' '; ЧГ=0"), Штрихкод["name"]));
				
				//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Стикер);		
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

Функция СформироватьПечатнуюФормуСтикеровПоДаннымОзон(Штрихкоды)Экспорт	
	УстановитьПривилегированныйРежим(Истина);
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_mega_ЗаказПокупателя_FBS_OZON_СтикерПоДаннымОзон";
	ПервыйДокумент = Истина;
	
	Для Каждого Штрихкод Из Штрихкоды Цикл 
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		
		ТабличныйДокумент.Вывести(СформироватьПечатнуюФормуСтикераПоДаннымОзон(Штрихкод["barcode"], Формат(Штрихкод["sku"], "ЧЦ=15; ЧДЦ=0; ЧРГ=' '; ЧГ=0"), Штрихкод["name"]));
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
КонецФункции



// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Стикер");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_mega_ЗаказПокупателя_FBS_OZON_Стикер";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Стикер'");
		
		СформироватьПечатнуюФормуСтикеры(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати, ПараметрыПечати);
		
	КонецЕсли;
	
//	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Стикер") Тогда
//		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
//			КоллекцияПечатныхФорм,
//			"Стикер",
//			НСтр("ru = 'Стикер'"),
//			СформироватьПечатнуюФормуСтикеры(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
//			,
//			"Документ.mega_ЗаказПокупателя_FBS_OZON.ПФ_MXL_Стикер");
//	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "СтикерПоДаннымОзон");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_ЗаказПокупателя";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Стикер (по данным озон)'");
		
		СформироватьПечатнуюФормуСтикерыЛокализация(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати, ПараметрыПечати);
		
	КонецЕсли;
		
//	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СтикерПоДаннымОзон") Тогда
//		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
//			КоллекцияПечатныхФорм,
//			"СтикерПоДаннымОзон",
//			НСтр("ru = 'Стикер (по данным озон)'"),
//			СформироватьПечатнуюФормуСтикерыЛокализация(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
//			,
//			"Документ.mega_ЗаказПокупателя_FBS_OZON.ПФ_MXL_СтикерПоДаннымОзон");
//	КонецЕсли;
			
	// параметры отправки печатных форм по электронной почте
	ЭлектроннаяПочтаУНФ.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, 
		КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
		// Расходная накладная
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Стикер";
	КомандаПечати.Представление = НСтр("ru = 'Стикер'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 10;
	
	
	// Расходная накладная
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СтикерПоДаннымОзон";
	КомандаПечати.Представление = НСтр("ru = 'Стикер (по данным озон)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 11;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
